#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-GSoShCvbavCwskzB

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_instance.composer_internal: Refreshing state... [id=i-0f3d9c62e8a3c38d9]
aws_instance.composer_external: Refreshing state... [id=i-0d6ed139b1e6125d6]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-1524497874]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-6b93629a-abab-4866-9715-12e8decf1e81]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-4091634052]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-8d6ce64a-1d32-4e0b-8500-441a36580d47]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0d6ed139b1e6125d6" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0d6ed139b1e6125d6" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-204-168-140.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.204.168.140" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R6+W+kSp7n75b6f2CqnzS7emObIzOrsrprNEkCeZkIExBBwuyoxOWEIDgKyAO63/++CtJVY1fV85vZXWnVlpBNEN/78z3CsKzKLim7W6evk49CcWRdVgdNd19klyT+ixBWxzIOmv7TO3Nj6irEQFsg790Nv7slSdNmVflRkO7EP9386eb29uWmP9185a1lbV21WTfuDbouiNIiKbu/CE8ZS8qgSD69y8qsu4ueDu/+k8ppgrJ9SppbvYyqOCsPH4X3Yda92DCq3CWX7j5i1TG+jaryKTv86cbMiuQH5f78cs/NzbFNmvbjjSDcClyDj0ISybd88UYQBKFt08/BsUurJhuS+HOe9ONe/nMrvGvb9LZpA2GxWCxUBQzBUuojWee32sJaqIvFYrmwlhf6ZGw2bPW0LOdZxNZ94Ta62jhYZg+zLrdXjpTU7+Pl43CWqDdzy9Rij3uzTh6bDFzAnq0+RC6c3yOjVmNxmBtn0P+aPx3S+dOxB95kvvnVDGawd4h6mKagMi5PaL+aZusuurctVoa6ke1qO5+wrK4mlt+pXXFYfDnk9mKmDWl/CGfHqTnPLs7mMnFVerRNcbW3BkDr5KnP3OOv7Qb9msq4sfLdQj0eN54VNpT9aqSkCB5Ozal3oHxsYXcqPZWm4eO5h+9l95EG9S6+n6dO8OVRl85GP8OGXO6jyePhLB4yK5y1WWg4w3vgJBdXmVrzD19qC7qmt4vqg98wO1ivd75tpt0A35ux38AHA+8rW1oki35ySLsINFB1WDi1T4/vlWEQv6jIkKMlnEDxXE/P5y+P6eksl12o1M7DYxcn3fZXMhWtx7Iu971tl34tD8Y5SmQp3F9m78t0zsr0ofEPNHkfVVb5uDAu9xFTZrq97Q/Z8TFSz7/m0gfvyDxzj78Eapeftw85olpNnb2cTM2tNKu09+12HU3u3WnePz2cYrMlafxFWu7XK0JgPVSHUJxPiZeJaG/UpY/upYQclvfoV5f0nffkfRCbJwKjeFHJK/+p3E4HD+H9djs3/TwoLxdFf49hlutbMG8xlUVxmC37Xtw8bb444VZSp0/vn2IliFDzMNEiD8fG5l5Se+DODIm+j/xssYLbHQiHvSE6Svf04SImkvXpk1AEtGr+rUniNOjuoqp49xrvSSxPp9J8xPzyinnmaxsJOPqUr20eVYkabFLPDEfNLmtndob5bP+hpPf++6R6BJZ+b4rn3eTDdCdU4TEOslfCbs5N1iWfeUV4Tss66NKPwn1X1Nf0/sxrxOdT0LSjZtG1CnwU/v6sKLRVvHnQPi+haW6cTx+UKHj6IIrJVJ7Kk3AiTZ7eP03Dp2mQiLESzSU5+jCX5vIz9RKaj9DW0VfyeSjH09l0Opm+n8qK8uH9RAqVRA6S4OnDe2X2PpGV4IMcT74Xvvi81JHz6cEWuwdbWiIcb51M1RDZYhv7W0s0MBqfid0yl7Y2RjrRgWa5/t4XDcXGW9UXGcEasEzZGwBRVzifSqHsi0lhTh0tl9EqxaGM1FhEyMX1QyjV22DtUyc3EMLnncUMNRb9L4gQYOVsbTkGQdhQYvGSmeK09o24jaRaA3ufhi5Q7FVKnVz6Yu3jR6KTmUOQn2BJJw7YBysAnX2txueaP5u8epYbe4dsUSyS0sXIxcTQkW6IcWH2NjVSoqSNsxKnCalnlghULDIFGYZv593JzVkVFwAuR523S4wN3ZdjA+uGPu515xq/t3IDWKXauMTwbAJMb0gfXLcGmLAyKVUEMVBNaftgFvEGaerF2xtDTA87j2wpyU0ZMHPq5+kFYXwJ8IW4+gfF1LYooWQI5LoylfrirNka01TBzDs9yGBruptLRFWSkNrxxEtgSpFCSN1b50oEGio8pRqcPZuEBpgRifhYUksrZw/BKlbh2ugiVtumOy88F/XJmtjOshvC3Ndtt5uYStR4g7HzCTmaBWhNI66XjIiutl0jydcQi4EjGyc/R41rEA2V5MFexzvsxitnjQZbB4HrgiJmsWsbdQDyySQW47PJjMB1NlNvSKVwr34xyWKHdb91dXPir4zA0aXUNViGHBXYe+SaOtjYpaogkZ29kh1DwnC47AZUEjnU0ImspD5ZV6dkn84iHckklx6j3NiGVj0J5VaJGOnImuRoRQwsbZeOHKsm7iQPSzZZk9Teqygctnmo+JfdsLigwhssPOkJBmosEtVyDUh0aYX28QYTpi+Zb5v6fGkxZqC8UnzH90wlP/ureRvZ853H/NrLWR3L6IilRQNyaQn1WDUJye19jFwsLT1srGwaM8AOQ+KoeSifd79Dq36lRfvYsLK5grEPLCwtLdeb/DyvLt8wah1qFZW1DGTGbDGahkb9EOWb3nGlINCNi60zM3EvqaMwN3IiBQ1s6ZAtRiU4uyUWzfVGQRJSPBFVcXGQEAYn2zCyZXFpYkf1AJ57vohkdw2W0Wq+stdb2dS7R9u9OEAiO3PvncGqPdmMle46asJVjcnaPMF9fQ5papPi0kVrfEKi9Og4eIfd7RovOxhQEkQDKZDo7wN9ojjORsJuR6C23YXrlNm50eJ9urHki4ZXZIJzADzHmIL9QiGraQk19cFmsZgQ1YJWLWI5Bla5UAAhtu9+EAHGE6zXvV0uhmDNTsDYTiDZIiR3feIC297HhZWncqCkwC78YySbimvPZeAyCdG0S3RptqRA9PJquhPrKcKGZK+ri5fHUoSBt1OMHSYIx8s5Cgevj/N47+F8iiX/wWPmxCOpaQ1bCEqDBu72ElE88SnS7dza2SVoHfuDEq3BNKLGCeyR6OXbI2C5ZO3N+TK71mSEp/pGBwZmaItyplkEGddaLu5+6BS80Fsy6eMVKwIXpPEKz5bZ4rBZqrq3Ryk8VIfNcnG9DJ9FJahDeTLbaOZhp6kTM8t3354vVcffb2vPPR+cknReQfpX9NdLNrVqAp1q4g3V2RxqBpy6AEOdg6ESoVbn3lBdzKGSfK0aPKc6e7SagvG+zn2nTn2nugBaXaBTZ+CVfqD25Wkar0nv26oaruJTVDAxWImzzRpUnrORAIvreJXaWDSMsAB9slfFwJ0frzZfL3sPhtglPcxUzaHSKZK3UuBe8odi3vvnV/5IwxXLgz2avqQfL316ipfq0nf9U1Tg2Uav0zBbXEx+aVUPnKqHy0VvapvLRo8BWXzvJxWGinWwXF/095sDzNSd504OprPg18ykeGbSw8Gki8G01bVDrFdxiN3tF98FIsxUFrpGHepG7q+3LFLMeaiALHZZ669IH4lq77uo8vbW0ZPn3Us7sEKyoCA0XqpW7G7bwDUPtkymG50d/eLD7AebDVXyikvt9eqDv88PlnspQ2XL/d3BTO0j+fd9/kJ3G4v6Aa9JFq4YfcAdS5zqsNM2Z6AdDl7BxJ31A6bGy3HneexepGiodj97/nydTa0uAK1zX6spjwV06hQ4vDFWU6hVkkkrEdCKHyIYdGpq0orHbDDpW3xVBijnW03H+NJK9LW68J1KMZ1q8IZK9midAacaOOZ9h/OvJM+pqe+8qe/U53qNfOrMc6reGyqF54pJK5nTm1p14Xo/8+K5dR71fptv72uVDIZKMbWacr4+98FQZ3wNaHXhcb9wO2hdmFolerSSTaeS3uarFp4z6iP72pin3Bc95DJoNXD9/NE/XL8643p6zpjnoq+9qS/nJZpOXZgDb651YdI653ryNaBVvUd5beA1opp6Ts14nHk9+YO4pd7AeVQDdLjOdeENY22SgTb6l3m0mpjDaIfiOdeY+nT081v6imN9GjieamYO1cXn8bli7sz19mklwatfe9MZa4LkO9UZvI1fhWPTG0a7zlDjvOvCoyPOLs88pqbDY1unHDccZz7H85t8VWZqlfycCxNfq1Og1QwM1cS/+mbqU46/mnnDyEs2OZ4pt+ttP1xreM243tyPPN7+Nb+4fhPwXOeBVkmAVhNuA6Cj/9/iO2LGHH1RXbg/fFqn5ihnjKHIbfc4Zvg63+tUZ55Lf8B39Bf3J9Q4Pkf7FPOag2ceH6hVE45lc3w24mEAWp16b8dN9B2eo1VvUp4LIzYmUOP3o6zR15DjmseU+4XnHa0ufxC3Ao445bWrzryB474aeA3iOB5xN2LjmuNjznC88bx4O48zcM37ftRFu8YP0OpsOnVqjrWtznkuenTs2WeeH6b2R/VhMUBtrJETngcer1fadQaAGo/jiOPziDenkuC1//Malfpv5vGC178MnH/eG9A+PYfylIWlNdtongQcU9ksD+dE08+mtri86inGQTI1Jpu9ypI1YuE480yHH2cZ1QPOYhpT82AVxsD7oyXPj5GCes9lx3htzjYr0Ad7VHuy0f5Ov9Msp15Z+OKgH/raf/J/0YvH3mq7XC9U+wVjEa0OP+e9kIFWq2isx/UKObWOnHppOrXOMYe02uB9g69bTr2E19605PgBXCenkhGtDURr1XRqDb1l/56IwWrObZ1u9I4ltrr1V+R4nSv5LLX4eexWHUtclkPKDJgjA+Z4Cmmsw9zrYW5dYI5USDcSzI3luEbJElIsQ7qRYW5OIE2XkC4USD0FUmsCc38F8636O77Wg/0Weq7EYDZ/e7Z7cUUy6QPXaCEFK0ijAeZcVryCNDYgRStIdQlSfYDUN2CuX2DuL8d9416rh7mvwxxPIOX64uG6xzov3/DnOGcZZPDcmMFMpeMc64I0/GFOfMb3ipXBHqXhUnUCNz56eyRFBW6fY8HnrjpapSwqJJ4DP8TC1fAZ7r1ho5NJvCJHf0XyZ1oSyUbpO7+HMRU7hnkgMsk2BmBR6bMoU9V4jyrfnYrXMwU7hW/Y+gLbarhGLCqmnEb2bfU5Vr+DHR1BPNQ0lKVzqAAWZdPX8ezPB6RPHVgCkfvxoQCncK+eeDwfivnglaQOV9YxVLblw1LVHWbOvH08vLXv+Wz00sffz7lDsNJ74Pj7YI8qzICK3CmNSnb+0Q9qCsdcq6YmPwvRsY/Rcba5znC8R/A+ePk6R/K6y+cF3qfHuccZZ8pX/vFkcwZXm5lP9RkYFjMg45nvLGa+q8/8As/AajMznXxm0nzma/rMc/DM17yZV+gzUzvM/BWeQcd6Pd+vCIP0wPHbw2KbwsKnkKoFpIcppAuelzmk+fm6hxSw2OaQehNYkBQWuIeU74++Ow+qvAdNee8Yz3p8PuR9i9uk8VlpnGXG/s3nRHCdHaY+7xda1ft8HqXjfPPKfuiaM59aM+CYM2+wZp5zGH1hFt7Md/HMHLideObJeAb5vaPPoIZnphbNvCEa13y6eG2/thAhTXNYmCIsjAIWlgipLsPCmkC6GSBVc1hgERbeBdLNBNJIhvQwQKqLkHrySEety3c9ZMpnT18bz718fhjG868z3vO5k/d0CsaeXafX/l3J/Gzs0ers87PGUGfwu3nGdPAMUG8GHXMGuB9GG7ldPO7WDAybmSdzmzcz4EQzoHGsHGae48280W/cfu+7+BsUFkYGqTcdaxjNp5BuC1jgMyz0M6SeCOmG2zpAepBgofeQ4gukqIB0MRmfF7r0ffyBVmfmdU69jLMyv6e8949+UMzr/wJE8zkH+IzH/TXiQhvnSj7XvMa/E83MYTEzuX0ynpmuNTM5tlf8zBzNPOrN/EIf/WDyXNGsEe9g4LjJZ6DgGNl8F/+DDGlMITUyWCAGaSRCajBYmAOk5hlSkMHCk699IOoh3fSQcsxsJEhVCiljI+3r+PNzDM9jag7jPCSNeHDGnJ+Aoc6fz6PSeD7lOcDtHupsnO/HNT6zv7af57hfeDOwsma+Zs2AZo62mTwPCjzz6GZmFnxdH2PP64WvLUZ8AGcz852f5T9IIY2mV0wvzl//2WTlZG3jycESiU10trIxUImOx2cPVg1szPTErTVLNHpbjtVYZEvLjbeEsG2IJXUnHQbTUb94Ir6Ymq8BF+WmootEjDN3H+uYsJ0tzwPbTWVPnKoYE3OZb5G1j1dBToiDt1sk6heCiRorselRAAMX7cM1CKyByJ4s0VhMK0+cgiAnikOQkWAJW3sGiZ6LRB5fHMzQPtrxZ7H48lmthlhy8D7e+tJ3erjdEhWp+/JFgcvSXcKMjV1cAiSnla+bUnDgeFYVX46NAEuqqccaVow1FllmigghvFUxIarloK2VI8Xax6UvkgfLnW+t3EBI2wyeaJwjgzguIY3rbGRPZGiZS5JHt40l1fBBnhpwpStkXykBq9OkXPRuAbJQAbmp15dY3Fbevj4FYq3gwTh6onSKyUbxtUUTkdqCOhEDgxShlO88tvVD3IGo775gebuMXXACDNluvpmYQzw1ibox9VYGMulibInm2pgl+nxvDukXJG0vgCIQukQG9rwmrjiQPQG+Vc880TAeBqNydOaQgixNKZ+Yq/hLkLUDIr4X6f4xImng55PGKtWz62wb4FgicCdKVAJo5m1vr7qTo5Evzt6wksI4L4tUD0XihpK/d3N0tiR1mRT+KXY3EyyloiXPCcLT1jbqzMeXxnfBLhDnmr0HE3vtieZ6awDX2EYKHgIMdkDDYlhGO2CwLMHeKVgbnbOuSweDKdIPg61329hgpbnaZrHIfLKSoC/G5YOCIBiA6pYxISuGfNG42A4pfBlQ7EqMSIYYn+ve3OuD5cbAyg0VyXXp01TxZV+JRaSOL5+oii1ibB7ErWrvYxXpRm4VMSR5ioBOVr5kEDdvRdeei6A8nEMKTkuWipFDABD1y04WT3Exp3AdE0yYTtjmHORbI1Rix8YGCUtLiVZ+4RibPiBxD1cXkYj1EODL0izQ9mGIL4EeXzDJdw7e+onu6xYBS1+culZuAAebPdzXfsj8s5fHKHY3g11My8DQT14/zx9kv4GGb5jUr3YDgAlVZVOeP6J8Xpk6Up1zPfKyDX1i5UYBdbK0sKRZhaHGIlGefdBauaHEIihdzB5iiS0tZhBbNxS0j92vduF8a4B1jG3MyJLlPdwjigY2c1m65Xo5BcuJfBnc3JTiAnQ+Buswn5xdEuehfumc0s9cfSt7w9ZN8KX70a7JzpfTKlhZg7MnvkmZ6InRNGG1Z+/JT19Cfv9i0CKG4ehbZGHEc3pp4a40rbqJRUaT0jfs0uqxSyjRLcWWjY25RzTB54mrbxqgz/udBCaBsjh7JN3HbvzFdy+PIGckKjcTpKHGktLAEpkHBuO0pL5kl4DGekyRgQaIu57oUy8Qu3OyZhdfIxp0WR6tqzNxUiccUudBIQCT9DEs0jXKNxPfxROLAJjo7YlgX/TlaodWBCd6t/EwWiF5a2BSzyABD/Fg9YFc9yGWMqIYtV3U+7jvcIy3bui2PS7ICuwB8RRwsSTv7GjoHLGtC/fGNDrUKcnngbPsNF+qNVzUlYdrm6zjKlDUHCv1BRcIRcpC8VwwcXJjE2adSFad6qzZxVNiNaQot+VIDEskR2tm2QSQZWGewjUBoVRN0JBLpp4Ozj5+fJAY9mS2RbhGiUvW5uBX8YCWXj/vsHjoUV67uAAuWoM9yf3Up9GJrJCNVmASZO0ukvOLxYwhYUZn4ksb6tIZuLFiOeLu+SW54eTW7/TA6tP3L11s++HzTvfszwsEPgVN+TE4tx/bJGqSri2CMjgkzcdje5sEbXcrfZwryvupLM3fz+fz510fk0uXNGXAPkdVUVdt0oyf99weprp4cJ7F2Vi1l2jz6Gwg+GwuwGL1/GXAAmj/Z1LbY9hGTVZ3WVXePpPcRlVRBGV8m1seq+ZfZXu2o5uf19B2wMLUP7VdcMjKw+1XvW+/6n0XnNu7bzdVGx4zFt9VzeF7n2kb9Ok+6aL75z3fOHyVqC+R7tjfDNWB9gg3wPmM0cOntOvq9uP9/Wtr775ZexcUwVCVz7rcv/x042cif1i466qC/fyLjn/PK5r9x/NNwFh1TuLPcVUEWdkKn4R/F951SVC8tPzdvwjv0mN4FzbJ+fv1c9XkSfPjI+GrhCgQPgnvfq51FNxGTXdXJ8W7m6/aXRn+t/X7f6bH739w99/5dO5y26YJY1dw/t63c/90H2blfRi06U2bdMJtcrxUQp3VyVOQsZu2OjZR8vNPdW7+LNhJJ3RpIrR92yWFkFZtVwZFcnfz9a+oY0KbdLdf74VfvsuBfxhTUXLI2i5pRnuzsu2CMkqEc9alAlqDu5v7Y9vcsyoK2CglOLfC67wSDkl3e126PQXsmAj/i2fU16UsFn7521vFiZfF34S/C/SLcNsI7+7skc7umqw8vBP+9ar4y1r0+Vnw5+dadEfbqrz5Sv7Wznf/RWbC34XRm00h3D79VxX4Rwm4ltSs6sdwP+eqsFwIUdJ02VMWBV1ydxMGbTKbCLexcCv89a9/FX7523cfi/0m/Kvwy99eVuvfXuT5d1K+VoI/kvHqK4WfSnhm9Edy8qT/v8BtUsZ1lZXd7bFhHLpvdJrffgL1n7b9P8T3q8b+GtAvH737vd1XxH5z6Bu+487hvnuB7Z8I//8DZl21P9sORIuV/uk+Tk735alIpFK6sZ2Fo1+HglPQ3LMs/HEweC7bx1pou6oJDolQld8wcXeTPQn/JByapOYx/cruN+G+bqrovqiOZdf+hcOovBGEPwt62R6bRNBVW8ha4enIWM+bfZlEXRILT1nTdnc3gvBUNYKzMXUkZKXwN/HuThHF3/4ixNXYF7Mnoe2CTvjlhV3fZPCfsEmCfPz7Kbt+xM2SpBakG0GIqzK5GVVZpkmUc157wx4/P39uSlkrBKxJgrgXiiBOuDqjjZen9nNWPlW/J7bIn9q7y1P76vnNqMIozwzyb5Xhm3dHQxIhzpok6qqm56KKrG2z8sAFF3mcNcLta99e2S3iWOiq62T11HZBKARlLIwO55RJlFbCu1/+9kKX315HiKsaJ0/BkXWtIAriO+HvQpckwm3wginXgbN8bdSoAEp4jbT1h6w8Xq4T26Vruewm4UhJoqoUbtFJ+AqtKxnH0gtv10kz2luVI2mUVmdOJXz+3lMff1j5iVNI0mRPvGoFz3PGM2KzVjg3WReELLkRhK46Rukr6vu7uqlOGVcjKw+fIw4NbsiYy3+48Sn7h2lSi5ge2+4/S3pXCYyPKSVP6kAoq/KWTypx0MRCXTXd1ZVZK7CkbQWW5QnrOVGY3PxZaKOgLJN4BF7dVGES3938WXCgBv9HkQZ9nJT/86PgJkKZ8E1RxFlwbDRZxNt9y2XyKJVJxydhgSWnhAlBJ7RVwfmP7eJfhPDYCeeEZ+4/d0IanBIh64QmO6SdUFbnu5tvSTLC9oqr+Pn3D+XsNqizu7aK8qS7i+9vOOD/+2TVKWmaLE7uoqp84q1mrKlHxoS//lXQoXHz7/a49T9uHkbn2l2TBMWn13fzD+9nN3zzVSSffOMgKarytklYFcQ8XI9NUgfNj2Xjn7kji6pLhOsRQmiT5pRFSTvG4qpne/eCcxG0+TcuV5p/k+6eqV7sS0qeI8LtbVmdv+2/inome/bCH9H8xHE/JMnt7Z9u/ncAAAD//0WX/6h1NAAA" -> "H4sIAAAAAAAA/9S6aW+kSp4v/N5Sfwem+kjzPDpjmyUzq7K6azRJArmZCBMQQcLcUYnNCUGwFJALdJ/vfhWkq8audfre+2LGErIJ4r///ksYllXZJWV36/R18l4ojqzL6qDp7ovsksR/EcLqWMZB0394Y25MXYUYaAvkvbnhd7ckadqsKt8L0p34p5s/3dzevtz0p5vPvLWsras268a9QdcFUVokZfcX4SljSRkUyYc3WZl1d9HT4c1/UjlNULZPSXOrl1EVZ+XhvfA2zLoXG0aVu+TS3UesOsa3UVU+ZYc/3ZhZkXyj3J9f7rm5ObZJ076/EYRbgWvwXkgi+ZYv3giCILRt+jE4dmnVZEMSf8yTftzLf26FN22b3jZtICwWi4WqgCFYSn0k6/xWW1gLdbFYLBfW8kKfjM2GrZ6W5TyL2Lov3EZXGwfL7GHW5fbKkZL6bbx8HM4S9WZumVrscW/WyWOTgQvYs9W7yIXze2TUaiwOc+MM+t/zp0M6fzr2wJvMN7+bwQz2DlEP0xRUxuUJ7VfTbN1F97bFylA3sl1t5xOW1dXE8ju1Kw6LT4fcXsy0Ie0P4ew4NefZxdlcJq5Kj7YprvbWAGidPPWZe/y93aDfUxk3Vr5bqMfjxrPChrLfjZQUwcOpOfUOlI8t7E6lp9I0fDz38K3sPtKg3sX389QJPj3q0tnoZ9iQy300eTycxUNmhbM2Cw1neAuc5OIqU2v+7lNtQdf0dlF98BtmB+v1zrfNtBvgWzP2G/hg4H1lS4tk0U8OaReBBqoOC6f26fGtMgziJxUZcrSEEyie6+n5/OkxPZ3lsguV2nl47OKk2/5OpqL1WNblvrft0q/lwThHiSyF+8vsbZnOWZk+NP6BJm+jyiofF8blPmLKTLe3/SE7Pkbq+fdceucdmWfu8adA7fLz9iFHVKups5eTqbmVZpX2tt2uo8m9O837p4dTbLYkjT9Jy/16RQish+oQivMp8TIR7Y269NG9lJDD8h797pK+8568d2LzRGAULyp55T+V2+ngIbzfbuemnwfl5aLobzHMcn0L5i2msigOs2Xfi5unzScn3Erq9OntU6wEEWoeJlrk4djY3EtqD9yZIdG3kZ8tVnC7A+GwN0RH6Z7eXcREsj58EIqAVs2/NUmcBt1dVBVvXuM9ieXpVJqPmF9eMc98bSMBR5/ytc2jKlGDTeqZ4ajZZe3MzjCf7d+V9N5/m1SPwNLvTfG8m7yb7oQqPMZB9krYzbnJuuQjrwjPaVkHXfpeuO+K+preH3mN+HgKmnbULLpWgffC358VhbaKNw/axyU0zY3z4Z0SBU/vRDGZylN5Ek6kydPbp2n4NA0SMVaiuSRH7+bSXH6mXkLzEdo6+kw+D+V4OptOJ9O3U1lR3r2dSKGSyEESPL17q8zeJrISvJPjydfCFx+XOnI+PNhi92BLS4TjrZOpGiJbbGN/a4kGRuMzsVvm0tbGSCc60CzX3/uiodh4q/oiI1gDlil7AyDqCudTKZR9MSnMqaPlMlqlOJSRGosIubh+CKV6G6x96uQGQvi8s5ihxqL/CRECrJytLccgCBtKLF4yU5zWvhG3kVRrYO/T0AWKvUqpk0ufrH38SHQycwjyEyzpxAH7YAWgs6/V+FzzZ5NXz3Jj75AtikVSuhi5mBg60g0xLszepkZKlLRxVuI0IfXMEoGKRaYgw/DtvDu5OaviAsDlqPN2ibGh+3JsYN3Qx73uXOP3Vm4Aq1QblxieTYDpDemD69YAE1YmpYogBqopbR/MIt4gTb14e2OI6WHnkS0luSkDZk79PL0gjC8BvhBXf6eY2hYllAyBXFemUl+cNVtjmiqYeacHGWxNd3OJqEoSUjueeAlMKVIIqXvrXIlAQ4WnVIOzZ5PQADMiER9Lamnl7CFYxSpcG13Eatt054Xnoj5ZE9tZdkOY+7rtdhNTiRpvMHY+IUezAK1pxPWSEdHVtmsk+RpiMXBk4+TnqHENoqGSPNjreIfdeOWs0WDrIHBdUMQsdm2jDkA+mcRifDaZEbjOZuoNqRTu1U8mWeyw7reubk78lRE4upS6BsuQowJ7j1xTBxu7VBUksrNXsmNIGA6X3YBKIocaOpGV1Cfr6pTs01mkI5nk0mOUG9vQqieh3CoRIx1ZkxytiIGl7dKRY9XEneRhySZrktp7FYXDNg8V/7IbFhdUeIOFJz3BQI1FolquAYkurdA+3mDC9CXzbVOfLy3GDJRXiu/4nqnkZ381byN7vvOYX3s5q2MZHbG0aEAuLaEeqyYhub2PkYulpYeNlU1jBthhSBw1D+Xz7ge06mdatI8NK5srGPvAwtLScr3J9/Pq8gWj1qFWUVnLQGbMFqNpaNQPUb7pHVcKAt242DozE/eSOgpzIydS0MCWDtliVIKzW2LRXG8UJCHFE1EVFwcJYXCyDSNbFpcmdlQP4Lnni0h212AZreYre72VTb17tN2LAySyM/feGazak81Y6a6jJlzVmKzNE9zX55CmNikuXbTGJyRKj46Dd9jdrvGygwElQTSQAon+PtAniuNsJOx2BGrbXbhOmZ0bLd6nG0u+aHhFJjgHwHOMKdgvFLKallBTH2wWiwlRLWjVIpZjYJULBRBi++47EWA8wXrd2+ViCNbsBIztBJItQnLXJy6w7X1cWHkqB0oK7MI/RrKpuPZcBi6TEE27RJdmSwpEL6+mO7GeImxI9rq6eHksRRh4O8XYYYJwvJyjcPD6OI/3Hs6nWPIfPGZOPJKa1rCFoDRo4G4vEcUTnyLdzq2dXYLWsd8p0RpMI2qcwB6JXr49ApZL1t6cL7NrTUZ4qm90YGCGtihnmkWQca3l4u6bTsELvSWTPl6xInBBGq/wbJktDpulqnt7lMJDddgsF9fL8FlUgjqUJ7ONZh52mjoxs3z35flSdfz9tvbc88EpSecVpH9Ff71kU6sm0Kkm3lCdzaFmwKkLMNQ5GCoRanXuDdXFHCrJ16rBc6qzR6spGO/r3Hfq1HeqC6DVBTp1Bl7pB2pfnqbxmvS+rarhKj5FBRODlTjbrEHlORsJsLiOV6mNRcMIC9Ane1UM3PnxavP1svdgiF3Sw0zVHCqdInkrBe4lfyjmvX9+5Y80XLE82KPpS/rx0qeneKkufdc/RQWebfQ6DbPFxeSXVvXAqXq4XPSmtrls9BiQxdd+UmGoWAfL9UV/vznATN157uRgOgt+zUyKZyY9HEy6GExbXTvEehWH2N1+8l0gwkxloWvUoW7k/nrLIsWchwrIYpe1/or0kaj2vosqb28dPXnevbQDKyQLCkLjpWrF7rYNXPNgy2S60dnRL97NvrHZUCWvuNRerz74+/xguZcyVLbc3x3M1D6Sf+zzF7rbWNQPeE2ycMXoA+5Y4lSHnbY5A+1w8Aom7qxvMDVejjvPY/ciRUO1+97z5+tsanUBaJ37Wk15LKBTp8DhjbGaQq2STFqJgFb8EMGgU1OTVjxmg0l/xldlgHK+1XSML61EX6sL36kU06kGb6hkj9YZcKqBY953OP9K8pya+s5P9Z36XK+RT515TtV7Q6XwXDFpJXN6U6suXO9nXjy3zqPeP+fb+1olg6FSTK2mnK/PfTDUGV8DWl143C/cDloXplaJHq1k06mkn/NVC88Z9ZF9bcxT7osechm0Grh+/ugfrl+dcT09Z8xz0dd+qi/nJZpOXZgDb651YdI653ryNaBVvUd5beA1opp6Ts14nHk9+UXcUm/gPKoBOlznuvCGsTbJQBv9yzxaTcxhtEPxnGtMfTr6+Wf6imN9GjieamYO1cXn8bli7sz19mklwatfe9MZa4LkO9UZ/By/CsemN4x2naHGedeFR0ecXZ55TE2Hx7ZOOW44znyO55/yVZmpVfJzLkx8rU6BVjMwVBP/6pupTzn+auYNIy/Z5Him3K6f++Faw2vG9eZ+5PH2r/nF9ZuA5zoPtEoCtJpwGwAd/f8zviNmzNEX1YX7w6d1ao5yxhiK3HaPY4av871Odea59Au+o7+4P6HG8Tnap5jXHDzz+ECtmnAsm+OzEQ8D0OrU+3ncRN/hOVr1JuW5MGJjAjV+P8oafQ05rnlMuV943tHq8ou4FXDEKa9ddeYNHPfVwGsQx/GIuxEb1xwfc4bjjefFz/M4A9e870ddtGv8AK3OplOn5ljb6pznokfHnn3m+WFqv6oPiwFqY42c8DzweL3SrjMA1HgcRxyfR7w5lQSv/Z/XqNT/aR4veP3LwPn7vQHt03MoT1lYWrON5knAMZXN8nBONP1saovLq55iHCRTY7LZqyxZIxaOM890+HaWUT3gLKYxNQ9WYQy8P1ry/BgpqPdcdozX5myzAn2wR7UnG+0P+p1mOfXKwhcHfdPX/pP/i1489lbb5Xqh2i8Yi2h1+D7vhQy0WkVjPa5XyKl15NRL06l1jjmk1QbvG3zdcuolvPamJccP4Do5lYxobSBaq6ZTa+hn9u+JGKzm3NbpRu9YYqtbf0WO17mSz1KL78du1bHEZTmkzIA5MmCOp5DGOsy9HubWBeZIhXQjwdxYjmuULCHFMqQbGebmBNJ0CelCgdRTILUmMPdXMN+qP/C1Huy30HMlBrP5z2e7F1ckkz5wjRZSsII0GmDOZcUrSGMDUrSCVJcg1QdIfQPm+gXm/nLcN+61epj7OszxBFKuLx6ue6zz8if+HOcsgwyeGzOYqXScY12Qht/Mic/4XrEy2KM0XKpO4MZHb4+kqMDtcyz43FVHq5RFhcRz4JtYuBo+w703bHQyiVfk6K9I/kxLItkofedHGFOxY5gHIpNsYwAWlT6LMlWN96jy3al4PVOwU/gTW19gWw3XiEXFlNPIvq0+x+oH2NERxENNQ1k6hwpgUTZ9Hc/+fED61IElELkfHwpwCvfqicfzoZgPXknqcGUdQ2VbPixV3WHmzNvHw8/2PZ+NXvr46zl3CFZ6Dxx/H+xRhRlQkTulUcnO3/pBTeGYa9XU5GchOvYxOs421xmO9wjeBy+f50hed/m8wPv0OPc440z5yj+ebM7gajPzqT4Dw2IGZDzzncXMd/WZX+AZWG1mppPPTJrPfE2feQ6e+Zo38wp9ZmqHmb/CM+hYr+f7FWGQHjh+e1hsU1j4FFK1gPQwhXTB8zKHND9f95ACFtscUm8CC5LCAveQ8v3RV+dBlfegKe8d41mPz4e8b3GbND4rjbPM2L/5nAius8PU5/1Cq3qfz6N0nG9e2Q9dc+ZTawYcc+YN1sxzDqMvzMKb+S6emQO3E888Gc8gv3f0GdTwzNSimTdE45pPF6/t1xYipGkOC1OEhVHAwhIh1WVYWBNINwOkag4LLMLCu0C6mUAayZAeBkh1EVJPHumodfmqh0z57Olr47mXzw/DeP51xns+d/KeTsHYs+v02r8rmZ+NPVqdfX7WGOoMfjXPmA6eAerNoGPOAPfDaCO3i8fdmoFhM/NkbvNmBpxoBjSOlcPMc7yZN/qN2+99FX+DwsLIIPWmYw2j+RTSbQELfIaFfobUEyHdcFsHSA8SLPQeUnyBFBWQLibj80KXvo4/0OrMvM6pl3FW5veU9/7RD4p5/V+AaD7nAJ/xuL9GXGjjXMnnmtf4d6KZOSxmJrdPxjPTtWYmx/aKn5mjmUe9mV/oox9MniuaNeIdDBw3+QwUHCObr+J/kCGNKaRGBgvEII1ESA0GC3OA1DxDCjJYePK1D0Q9pJseUo6ZjQSpSiFlbKR9HX9+juF5TM1hnIekEQ/OmPMTMNT583lUGs+nPAe43UOdjfP9uMZn9tf28xz3C28GVtbM16wZ0MzRNpPnQYFnHt3MzIKv62Pseb3wtcWID+BsZr7zvfwHKaTR9IrpxfnzP5usnKxtPDlYIrGJzlY2BirR8fjswaqBjZmeuLVmiUZvy7Eai2xpufGWELYNsaTupMNgOuonT8QXU/M14KLcVHSRiHHm7mMdE7az5Xlgu6nsiVMVY2Iu8y2y9vEqyAlx8HaLRP1CMFFjJTY9CmDgon24BoE1ENmTJRqLaeWJUxDkRHEIMhIsYWvPINFzkcjji4MZ2kc7/iwWXz6r1RBLDt7HW1/6Sg+3W6IidV++KHBZukuYsbGLS4DktPJ1UwoOHM+q4suxEWBJNfVYw4qxxiLLTBEhhLcqJkS1HLS1cqRY+7j0RfJgufOtlRsIaZvBE41zZBDHJaRxnY3siQwtc0ny6LaxpBo+yFMDrnSF7CslYHWalIveLUAWKiA39foSi9vK29enQKwVPBhHT5ROMdkovrZoIlJbUCdiYJAilPKdx7Z+iDsQ9d0nLG+XsQtOgCHbzTcTc4inJlE3pt7KQCZdjC3RXBuzRJ/vzSH9hKTtBVAEQpfIwJ7XxBUHsifAt+qZJxrGw2BUjs4cUpClKeUTcxV/CrJ2QMT3It0/RiQN/HzSWKV6dp1tAxxLBO5EiUoAzbzt7VV3cjTyydkbVlIY52WR6qFI3FDy926OzpakLpPCP8XuZoKlVLTkOUF42tpGnfn40vgu2AXiXLP3YGKvPdFcbw3gGttIwUOAwQ5oWAzLaAcMliXYOwVro3PWdelgMEX6YbD1bhsbrDRX2ywWmU9WEvTFuHxQEAQDUN0yJmTFkC8aF9shhS8Dil2JEckQ43Pdm3t9sNwYWLmhIrkufZoqvuwrsYjU8eUTVbFFjM2DuFXtfawi3citIoYkTxHQycqXDOLmrejacxGUh3NIwWnJUjFyCACiftnJ4iku5hSuY4IJ0wnbnIN8a4RK7NjYIGFpKdHKLxxj0wck7uHqIhKxHgJ8WZoF2j4M8SXQ4wsm+c7BWz/Rfd0iYOmLU9fKDeBgs4f72g+Zf/byGMXuZrCLaRkY+snr5/mD7DfQ8A2T+tVuADChqmzK80eUzytTR6pzrkdetqFPrNwooE6WFpY0qzDUWCTKsw9aKzeUWASli9lDLLGlxQxi64aC9rH72S6cbw2wjrGNGVmyvId7RNHAZi5Lt1wvp2A5kS+Dm5tSXIDOx2Ad5pOzS+I81C+dU/qZq29lb9i6Cb5039o12flyWgUra3D2xDcpEz0xmias9uw9+e5LyK9fDFrEMBx9iyyMeE4vLdyVplU3schoUvqGXVo9dgkluqXYsrEx94gm+Dxx9U0D9Hm/k8AkUBZnj6T72I0/+e7lEeSMROVmgjTUWFIaWCLzwGCcltSX7BLQWI8pMtAAcdcTfeoFYndO1uzia0SDLsujdXUmTuqEQ+o8KARgkj6GRbpG+Wbiu3hiEQATvT0R7Iu+XO3QiuBE7zYeRiskbw1M6hkk4CEerD6Q6z7EUkYUo7aLeh/3HY7x1g3dtscFWYE9IJ4CLpbknR0NnSO2deHemEaHOiX5PHCWneZLtYaLuvJwbZN1XAWKmmOlvuACoUhZKJ4LJk5ubMKsE8mqU501u3hKrIYU5bYciWGJ5GjNLJsAsizMU7gmIJSqCRpyydTTwdnHjw8Sw57MtgjXKHHJ2hz8Kh7Q0uvnHRYPPcprFxfARWuwJ7mf+jQ6kRWy0QpMgqzdRXJ+sZgxJMzoTHxpQ106AzdWLEfcPb8kN5zc+kEPrD58/dLFth8+7nTP/rhA4EPQlO+Dc/u+TaIm6doiKIND0rw/trdJ0Ha30vu5orydytL87Xw+f971Prl0SVMG7GNUFXXVJs34ec/tYaqLB+dZnI1Ve4k2j84Ggo/mAixWz18GLID2fy65PYZt1GR1l1Xl7TPJbVQVRVDGt7nlsWr+Wb5nO7r5cQ1tByxM/UPbBYesPNx+1v32s+53wbm9+3JTteExY/Fd1Ry+9pu2QR/uky66f97zhcNnifoS6Y79xVgdaI9wA5yPGD18SLuubt/f37+29u6LtXdBEQxV+azL/cvPN74n8puFu64q2Pe/6vj3vKLZfzzfBIxV5yT+GFdFkJWt8EH4d+FNlwTFS8vf/IvwJj2Gd2GTnL9eP1dNnjTfPhI+S4gC4YPw5vtaR8Ft1HR3dVK8ufms3ZXhP6zf/zM9fvzR3T/y+dzltk0Txq7g/NH3c/90H2blfRi06U2bdMJtcqyEOquTpyBjN211bKLk+1/r3PxZsJNO6NJEaPu2SwohrdquDIrk7ubzX1HHhDbpbj/fC799lQL/UyxFySFru6QZzc3KtgvKKBHOWZcKaA3ubu6PbXPPqihgo5Dg3Aqvs0o4JN3tden2FLBjIvwvnk+fl7JY+O1vvypPfwh/F+gn4bYR3tzZI53dNVl5eCP861Xxl5Xo47Pgj8+V6I62VXnzmfxnO9/8F5kJfxdGZzaFcPv0X1Xgf0i8taRmVT9G+zlRheVCiJKmy56yKOiSu5swaJPZRLiNhVvhr3/9q/Db3776WuwP4V+F3/72slT/8SLJv5LyuQz8SsarzxS+K+GZ0a/k5En/fwHbpIzrKiu722PDOHJ/0mb++A7Sv9v3fwnvV539NZ5fPnrzo91XwH5x6E98x53DffcC2t8R/t8Fyze6an+0HYgWK/3DfZyc7stTkUildGM7C0e/DgmnoLlnWfjtoPBcx4+10HZVExwSoSq/wOTuJnsS/kk4NEnNw/yZ3R/Cfd1U0X1RHcuu/QtHVnkjCH8W9LI9Nomgq7aQtcLTkbGeN/8yibokFp6ypu3ubgThqWoEZ2PqSMhK4W/i3Z0iin/8RYirsU9mT0LbBZ3w2wu7vsjgP2GTBPn491N2/bCbJUktSDeCEFdlcjOqskyTKOe89oY9fpL+3KWyVghYkwRxLxRBnHB1RhsvT+3HrHyqfiS2yJ/au8tT++r5zajCKM8M8i/F4ot3R0MSIc6aJOqqpueiiqxts/LABRd5nDXC7WvfXtkt4ljoquuk9dR2QSgEZSyMDueUSZRWwpvf/vZClz9eR4irGidPwZF1rSAK4hvh70KXJMJt8IIp14GzfG3UqABKONJs/SErj5frBHfpWi67SThSkqgqhVt0Ej5D60rGsfTC23XSjPZW5UgapdWZUwkfv/bU+29WvuMUkjTZEy9kwfPg8YzYrBXOTdYFIUtuBKGrjlH6ivr+rm6qU8bVyMrDx4hDgxsypvcvNz5l/21S/RdtaxHTY9v9Z5HvKoHxuaXkOR0IZVXe8tElDppYqKumu3oyawWWtK3AsjxhPScKk5s/C20UlGUSj7irmypM4rubPwsO1OD/V6RBHyfl//9ecBOhTPimKOIsODSaLOL9v+UyeZDKpOODscCSU8KEoBPaquD8xwbyL0J47IRzwhP3nzshDU6JkHVCkx3STiir893NlxwZUXuFVfz8+5tqdhvU2V1bRXnS3cX3Nxzv/zhZdUqaJouTu6gqn3jzGUvqkTHhr38VdGjc/Ls9bv2Pm4fRuXbXJEHx4fXd/N3b2Q3ffBXJJ+E4SIqqvG0SVgUxD9djk9RB823V+GfuyKLqEuF6ohDapDllUdKOsbjq2d694FwEbf6Fy5Xm36S7Z6oX+5KSp4hwe1tW5y/7r6KeyZ698Cua7zjumxy5vf3Tzf8OAAD//8oAS3uINAAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0f000fe7b17f2db55" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0f3d9c62e8a3c38d9" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0f3d9c62e8a3c38d9" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R6eW/cSJbn/wL6O3DcBcwuaiTxyKSd7vZgkkkyLzFCPCJ4zA4MXkoyGDxMMg+yu777IpiyR7JdqpndBRZtgKhiHC/e+73fO0LJVV31adXfOkOTfuTKI+3zJmz7+zK/pMlfuKg+VknYDp/eGVtDUyAC6tLy392wt1uctl1eVx854Y7/082fbm5vXy76081X2WreNXWX99PasO/DOCvTqv8L95TTtArL9NO7vMr7u/jp8O4/dzltWHVPaXurVXGd5NXhI/c+yvsXCyaV+/TS38e0Pia3cV095Yc/3Rh5mf6g3J9frrm5OXZp23284bhbjmnwkUtj8ZYN3nAcx3Vd9jk89lnd5mOafC7SYVrL/t1y77ouu227kFsul0tFAmO4EoZY1NirujSXynK5XC3N1YU86dstXT+tqkUe081Quq2mtA4S6YPcF/baEdLmfbJ6HM8C8WW3ykz66BlN+tjm4AI8uv4Qu3Bxb+mNkvDjQj+D4dfi6ZAtno4D8GeL7a9GKMPBwcphnoFavzxZ3nqeb/r43jZpFWl6vm/sYkbzpp6ZQa/05WH55VDYS1kds+EQyce5scgvzvYycxVytA1+7ZkjIE36NOTu8ddua/2aiag1i/1SOR63vhm1hP6qZ7gMH07taXCgeOxgf6p8hWTR43mA70X3kYTNPrlfZE745VETzvogI12svHj2eDjzh9yM5C6PdGd8D5z04kpzc/HhS2NC1/D3cXMIWmqHm80+sI2sH+F7Iwla+KAjr7aFZbocZoesj0ELFYdGc/v0+F4aR/6LYulivIIzyJ+b+fn85TE7ncWqj6TGeXjsk7Tf/YrnvPlYNZU32HYVNOKon+NUFCLvIr+vsgWtsoc2OJD0fVyb1eNSv9zHVJI1ezcc8uNjrJx/LYQP/pH6hoe+hEpfnHcPhUXUhjiemM6NnSDX6vtut4ln9+68GJ4eTonR4Sz5Iqy8zRpj2Iz1IeIXc+znvOXpTRVY90KKD6t761cXD73/5H/g2ycM42RZi+vgqdrNR99C3m63MIIirC4XSXuPYF5oO7DoEBF5fpRXw8Bvn7ZfnGgnKPOn90+JFMZW+zBTYx8l+vZeUAbgyrpA3sdBvlzD3R5Eo6fzjtQ/fbjwqWB++sSVIanbf2vTJAv7u7gu373me5qI87mwmDi/unKeBupWAI42Z2PbR0UgOp01su4o+WXjyGdYyN6HitwH79P6EZjavcGf97MP8z1XR8ckzF8ddnNu8z79zDLCc1g2YZ995O77srmG92eWIz6fwrabNIuvWeAj9/dnRaGtoO2D+nkFDWPrfPogxeHTB55P5+JcnEUzYfb0/mkePc3DlE+keCGI8YeFsBCfd6+g8Qhtzfq6fRGJyVyez2fz93NRkj68nwmRlIphGj59eC/J71NRCj+Iyez7w5efV5rlfHqw+f7BFlYWSnZOrqgW3iEbBTuT15E1zfH9qhB2NrI0rAHVdAMv4HXJRjsl4ClGKjAN0R8BVtaomAuRGPBpacwdtRCtdYYi0VIS3rJc1DxEQrMLNwFxCt2y0HlvUl1J+OCLhTEwC7oxHR1bSJcS/pIb/LwJ9KSLhUYFXkAiF0j2OiNOIXwxveQRa1h2sBWkSNCwA7xwDaDjNUpybtjc7NVcoXsO3lkJjysXWS7CumZpOp+UxmATPcNS1jprfp7iRjZ5oCCeSpauB3bRn9yC1kkJ4GrSebdCSNcCMdGRpmvTWnehsnez0IFZKa2Ldd/GwPDH7MF1G4AwrdJKsSACiiHsHowy2VqqcvE9fUzIYe/jHcGFIQJqzIMiu1gIXUJ0wa72QTLUnZUSPIZiUxtSc3E2dINIJiHqnx5EsDPc7SUmCk5x4/j8JTSEWMK4GcxzzQPVKn2pHh2PziIdyFjAARKUyizoQ7hOFLjR+5g2tuEuSt+1hnSDbWfVj1ERaLbbzwwpbv1R3wcYH40SdIaeNCuKeVfdbSwhUC2aAEfUT0Fhta6OVavCD/Ym2SM3WTsba7Q1ELouKBOauLbehKCYzRI+ORtUD11nO/fHTIg85YuBl3ukBZ2rGbNgrYeOJmSuTnPLUYDtWa6hga1dKZLF07Nf0WOEKYpW/WhVWIxU64TXwpBu6lPqZXKsWSIuhMe40HeR2cwisZNiinu8wYW1xjoSditHTBQD9YKPBBtvcGZ7ihWNuyKSgst+XF6s0h9NNBswAkrCY8V0dYg1YW15yRZhqq1oYBvaYmVSqltFLQVO4BtScQ7Wiy62F3ufBo1f0CYRrSMSli0ohBXUEsXAuLC9xHKRsPKRvrZJQgE9jKmjFJF43v/OXuXrXstLdDNfSAgFwETCynT92c/j6vKNo+ahUayqEYFIqc3H80hvHuJiOziuEIaafrE1aqTuJXMk6sZOLFkjXTl4h6wKnN0K8cZmK1mCJfm8VSflQbAQONm6nq/KS5s4ig/Qwg94S3Q3YBWvF2t7sxMNrX+03YsDBLw3PP8M1t3JprRyN3EbrRuEN8YJes05IpmNy0sfb9DJ4oVHx0F75O42aNXDkOAwHnFp8YEXajPJcbYCcnsM1d0+2mTULvQOednWFC8qWuMZKgDwHX0OvKWE1/MKqsqDTRM+xYoJzYZHYgLMaikBjO3A/cADhGZIawa7Wo7hhp6AvptBvLMssR9SF9i2l5RmkYmhlAG7DI6xaEiuvRCBSwWLZH2qCfKKAN4v6vmeb+YW0gV7U1/8IhFiBPy9pO8RtlCyWljR6A9JkXg+KuZICB58asx8nBnmuIOg0kno7i4xQbOAWJpdmHu7Ap1jf5DiDZjHRD8Bz+L9YncEtBBMz1is8mtOttBc22pAR9TaWQVVTWzp11zO73+oFCzRmyIekjUtQxdkyRrJq3x52K4UzfesDB7qw3a1vD56QOMKNJE4k7eqcdiryszIi/23+ZXiBN6u8d3zwalw75d4eLX/+oiGWs+gU8/8sT4bY0OB05RgbAow1jxUm8If64sx1kKg1qPv1Gef1HMwvTdF4DRZ4NQXQOoLdJocvNIPNIE4z5INHgJbUaJ1copLyodrXt5uQO07WwHQpEnWmY14XY9KMKSewofu4ni1+frYHhgTFw8wV1SHCKdY3AmheykeysUQnF/hkUVrWoSeNX+5f3q0+SlZKavADU5xieSt1mRRvrwY7FHrATj1AFfLwVC3l62WALz8HicFRpJ5MN2AD7ztAebK3ndnB8NZskc2CJINcjgYZDkatrJxsPnKD4m7+xK4gIe5QiNXbyJNL4LNjsaSsYgkkCcu7YI1HmJeGQLXqn3PPPrion9pB5JwHpaYJCvFTNxdF7rGwRbxfKvRY1B+kH+wWVcEv7w0/qA8BF5xMN1LFUk7hncPc2WIxd/H/IXuNuK1A9rgPFpT8oB6mjr1Ya9uz0A9HPyS8nvzB05Nj+MuisS9CPFY7382//ycDbUpAWmKQG0I8wV0mgw4rDDWc6jWgkFqHpCaXSIodBpikJr5bDTIW3IVCgiTW88n/5KaD9SmDJxaMpx69Mda9EmTA6ceGecDh8mvBd9pSOC8qe88YHpNcprcd+rBH2uJxYpBapHtN9T6wvR+lsVi6zzp/bbcIVBrEYy1ZKgNYXIDhsHY5GwMqE3pM1yYHaQpDbXmfVKLhlMLb8tVSt+Z9BEDdYpThsUA2RmkHpl+wYQP06/JmZ6+M8U5H6hv6stk8YbTlMbIimtTGqQpmJ5sDKj14BOWG1iOqOe+01DmZ5ZP/sBvmT8yGfUIHaZzU/rjlJtEoE74Up/UM2Oc7JB85+rTgEw4v6UvP+WnkfGpocZYXwLmnyvnzkzvgNQCvOI6GM6UE4TAqc/gbf5KjJv+ONl1hiqT3ZQ+mXh2eZYxNxzm2yZjvGE8Cxif35SrUEOtxedYmAVqkwG1oWCsZ8EVm3lAGP8a6o+TLNFgfCbMrrdxuObwhjK9GY7M38E1vph+M/Cc54FaC4DUM2YDIBP+b8mdOGNMWNQXhkdAmsyYzpl8yDPbfcYZNs7WOvWZxdIfyJ3wYnhClfFzsk8yrjF4Zv6Baj1jXDamuYkPI1CbzH/bb3zgsBitB4OwWJi4MYMqe5/OmrCGjNfMpwwXFnekvvyB30o48ZTlrib3R8b7emQ5iPF44t3EjWuMTzHD+Mbi4u04zsE17odJF/XqP0Dqs+E0mTHltqZgseiTqWafWXwY6h/lh+UI1SlHzlgc+CxfqdceAKrMjxOPzxPfnFqA1/rPclQWvBnHS5b/cnD+eW2wvOwciXMaVaa8VX0BOIa0XR3OqaqdDXV5eVVT9INgqFQ0BoWmG4tGU88zH3/sZRQfOMt5QoyDWeojq4+muDjGkjX4Lj0mG0PersEQelbji3r3O/VONZ1mbaKLY/1Q1/5T/otaPNVW22V6WU1QUhqT+vBz2UsRqI1iTfm4WVtOo1lOszKcRmOcs9RGZ3WDjZtOs4LX2rRi/AFMJ6cWLdLoFmkUw2lU6y37PcyH6wWzdb7Veprayi5Y4+O1r2S91PLnvlv3NHVpAQnVYWHpsEBzSBINFv4AC/MCC0uBZCvAQl9NYwSvIEEiJFsRFsYMkmwFyVKCxJcgMWewCNaw2Cm/g7UWejvouwKF+eLt3u7FE4t4CF29gwSsIYlHWLCzkjUkiQ6JtYZEEyDRRkgCHRbaBRbBalo3rTUHWAQaLNAMEqYvGq9rzPPqDTynPkvHo+8mFOYKmfpYF2TRD33iM7/XtAo9K4tWihO6ydH3LCEuUffsC9Z3NfE6o3EpsBj4wReuis7Q88ethmfJGh+DNS6e9+JY1KvA+T2OKcjRjQMWcb7VAY2rgMa5oiSeVQfunL/eKegpesPWF9xWoo1F43LO9oiBrTz76ne4o1kQjQ2JROEcSYDG+fy1P4fzwdLmDqwAz3B8KMEp8pQT8+dDuRj9CjfR2jxG0q56WCmaQw3Z95LxrXXPd6OXGH/f547hWhuAE3ihZ9WIAsVy5ySu6PlHHJQMTrFWzw12FyJTHSNTb3Pt4ViNYHXw8rWPZHmX9QusTk99jzP1lK/w8UVDhuutHBBNBuNSBiKSA2cpB64mByWSwXorG04hG6SQA1WTfQfJgerLfqnJhnqQgzWSoWO+7u/XmEJyYPwdYLnLYBkQSJQSksMckiWLywKS4nxdg0tY7gpI/BkscQZLNEDC1sff3QcVVoPmrHZMdz3WH7K6xWxSWa809TJT/WZ9Irj2DvOA1Qu1HgLWj5Kpv3llP3QNOSCmDBxD9kdT9p3DhIVR+nLgItkYmZ1I9kUkQ/buaDJUkWyoseyP8TQWkOVr+9UlD0lWwNLgYamXsDR5SDQRluYMku0IiVLAEvGw9C+QbGeQxCIkhxESjYfEF6d9xLx8V0PmrPcM1Oney/qHcbr/OtM76ztZTSdgqtlNdq3ftcjuxj6pzwG7a4xNDr/rZwwHyYD4MnQMGTAcJhuZXczvpgzGreyLzOatDJxYBirjykH2HV/2J9yY/f53/tcJLPUcEn8+5TBSzCHZlbBEZ1hqZ0h8HpIts3WE5CDAUhsgQRdIrBKS5WyaLzXhe/8DtcmNa596mXpl9k5Y7Z9wkIzr3wJ44zkGWI/H8Jp4oU59JetrXvPfiWVjXMoGs09EsuGassG4vWZ35lj2iS8HpTbhYLBYUc2J72BkvClkUDKObL/z/0GEJCGQ6DksLQpJzEOiU1gaIyTGGRKQw9IXr3UgHiDZDpAwzmwFSBQCCaXT3tf+Z/cYFsfEGKd+SJj44EwxPwNjUzzfR4XpfspigNk9NvnU309jrGd/bT+L8aD0ZbA25UA1ZaAak20Gi4MSyT7ZykbJxrXJ9yxfBOpy4gdwtnLg/Cz+QQZJPL9yenn++scms8AbG80OJo9trNG1jYCCNTTNPZgNsBHVUrdRTV4fbDFREp6uTDfZYUx3ERKUvXAYDUf54vPoYqiBClyrMCSNx3ySu16iIUz3trgIbTcTfX6uIISNVbGzTC9ZhwXGDtrtLF67YISVREoMnwAYupYXbUBojlj0RYEkfFb7/ByEBZYcbOkpEpDpUYi1gsfi9MOBbHnxns0l/Mu5RomQ4CAv2QXCd3q4/coqM/flDwUuzfYp1bd2eQktMasDzRDCA+OzIgVioodIUAwtUZGkbxBPc4O3LAvtFISxYjrWziwsyfSSKuDxg+kudmahW5a6HX1eP8c6dlyMW9fZij5PrVUhCD7ZtabQwAdxrsO1JmGvlkLaZGm1HNwS5JEECkNrLgm/q32vOYV8I6FRP/q8cErwVgrUZRvjxoQa5kMdl5FQ7H26CyLUg3jovyBxt0pccALUst1iOzPGZG5gZWtonQhE3CfI5I2NLqfawjPG7Isl7C6AWCBysQjsRYNdfsQeBoHZyD6v6w+jXjsadXCJV4ZQzIx18iXMu9HCgR9rwTHGWRgUs9aslLPr7FrgmDxwZ1JcAWgU3WCv+5Oj4i+Op5tpqZ9XZaZFPHYjIfDcwjqbgrJKy+CUuNsZEjLeFBfYQvPO1ps8QJc2cME+5Beq7YGZvfF5Y7PTgavvYgmNIQJ7oCI+quI90GmeIv8UbvTe2TSVg8Dc0g6jrfW7RKeVsd7lCU8DvBZgwCfVg2RBMALFrRKM19QKeP1iO7gMRECQK1As6HxybgbD00bTTYBZ6IolNlVAMikQAynhLWX68YkoyMT69oHfKbaXKJamF2aZQFxkFtDwOhB07BYd79oLHlSHc0TAaUUzPnYwALx22Yv8KSkXBG4SjDDVMN2ew2KnR1Li2EjHUWVK8TooHX07hDgZ4PrCY74ZQ3RZGaW1exiTS6glF4SLvYN2QaoFmonBKuDnrlnowEHGAL0miGhw9ovEStztaJfzKtS1kz8sigcxaKEe6AYJ6v0IYEoU0RAXj1axqA3NUpxzM8mydW1mFnoJNbwykaCapa4kPJaeMejMQpcSHlQuog+JQFcm1bGt6ZLlJe5Xu1Cx08EmQTaieEWLAXoWsUYquzTbMb2ckhZYvIxuYQhJCfoAgU1UzM4uTopIu/ROFeSuthP9ceem6NL/aNdsH4hZHa7N0fFwYBDK+3w8T2nj2x7+6Y+Q3/8waGJdd7SdZSKLxfTKRH1lmE2b8JSkVaDblTkgFxOsmZIt6lvDs0iKzjNX27ZAWwx7AcxCaXn2ceYlbvIlcC+PoKA4rrYzS7VaU8hCk6c+GPXTigSCXQGSaAmxdGuEqB+wNvdDvj+nG3oJVKxClxbxpj5jJ3OiMXMeJAwQzh6jMttYxXYWuGhmYgBTrTthFPCBWO+tNUap1m99ZK0tcacj3MgQg4dkNIdQbIYICTmW9MYuGy8ZepSgnRu53YBKvAYewL4ELqbgnx3VOsd050JPn8eHJsPFInRWvRoIjYrKpvZRY+NNUoeSUiCpuaDSsmJpKfkumDmFvo3ynsfrXnE29OJLiRIRq7DFmI8qS4w31LQxwKvSOEUbDCKhnlljIRhaNjpe8vggUOSLdGehxkpdvDHGoE5Ga+UPix7xh8EqGheVwLU2wMNFkAUkPuG1ZVtrMAvzbh+LxcWk+phSvTfQpYs04QzcRDIdfv/8I7nuFObv1MD60/c/utj2w+e95tuflxb4FLbVx/DcfezSuE37rgyr8JC2H4/dbRp2/a3wcSFJ7+eisHi/WCyeV33Mqz5tq5B+juuyqbu0nT7vue3qUzsrno+zkWKvrO2js4Xgs7EEy/XzlwFLoP6fndodoy5u86bP6+r2ecttXJdlWCW3henTevH1bN92NOPzBtoOWBrap64PD3l1uP2q9+1Xve/Cc3f37aXuomNOk7u6PXyPmbq1Pt2nfXz/vOabhK8naitLc+xvhmpAfYRb4HxG1sOnrO+b7uP9/amJ01s+ESRhPpN4eT5bREKc3C7GS/t+nJ/uXqNx9w2NO7bxLizDsa6eFb5/+X3Hz/T6YeCur0v6888+/r2oSf4fzy8hpfU5TT4ndRnmVcd94v6de9enYfkSnnf/wr3LjtFd1Kbn78fPdVuk7Y9T3NcT4pD7xL37udZxeBu3/V2Tlu9uvmp3Ffjf1u//mR6//1Xef+f7usttl6WUXhn8ex/Y/dN9lFf3UdhlN13ac7fp8VJzTd6kT2FOb7r62Mbpz7/nufkzZ6c912cp1w1dn5ZcVnd9FZbp3c3X/4t7ynVpf/v1nfvlu0D5hzHVSg9516ftZG9edX1YxSl3zvuMszbg7ub+2LX3tI5DOp0SnjvudXBxh7S/vQ7dnkJ6TLn/xSLq61CecL/87a0MxnLnb9zfOfKFu225d3f2tM/u27w6vOP+9ar4y4T1+fngz88J6450dXXzdftbK9/9F4Vxf+cmNNuSu336ryrwj+JwNW1oPUzufo5VbrXk4rTt86c8Dvv07iYKu1SecbcJd8v99a9/5X7523dflP3G/Sv3y99epvTfXsT5d6d8zQR/dMarTxl+esKzoD86p0iH/wveplXS1HnV3x5byqj7Rjn67SdU/2lv8If8flX9XxP65dS731t9Zew3QN/AjoHDsHvB7Z8c/v+HzJpif7YdaC3X2qf7JD3dV6cyFSrhxnaWjnbtHE5he0/z6Mfu4TltHxuu6+s2PKRcXX3jxN1N/sT9E3do04b59Ku437j7pq3j+7I+Vn33F0aj6obj/sxpVXdsU05TbC7vuKcjpQMr9lUa92nCPeVt19/dcNxT3XLO1tAsLq+4v/F3dxLP//YXLqmnupg/cV0f9twvL+z6dgb7F7VpeG3ynvLrl940TRtOuOG4pK7Sm0mVVZbGBZPl6fb0jfpzUco7LqRtGiYDV4ZJytSZbLw8dZ/z6qn+vWPL4qm7uzx1r+ZvJhWm84yw+JYZvqE7GZJySd6mcV+3AzuqzLsurw7s4LJI8pa7fY3tVdwySbi+vnZWT10fRlxYJdwEONuZxlnNvfvlby90+e21h5iqSfoUHmnfcTzHv+P+zvVpyt2GL4QyHZjI10ZNClgpy5G29pBXx8u1Y7v0HTu7TRlT0riuuFvrxH2l1nUb49ILtJu0neytq2lrnNVntov7/D1SH38Y+QkoOG3zJ5a1wuc+45mxeced27wPI5recFxfH+Ps1e77u6atTzlTI68On2NGDWbIFMt/uPAp/4cpUsuEHLv+P1N6X3OUtSkVC+qQq+rqlnUqSdgmXFO3/RXKvONo2nUczYuUDmxTlN78mevisKrSZCJe09ZRmtzd/JlzoAr/R5mFQ5JW//Mj56ZclbJFccxEMG60eczKfcfOZF6q0p51whxNTynlwp7r6pLJn8rFv3DRsefOKYvcf+65LDylXN5zbX7Ieq6qz3c334Jkou2VV8nzf39IZ7dhk991dVyk/V1yf8MI/9/fVp/Sts2T9C6uqydWaqaceqSU++tfOQ3qN/9uT0v/4+ZhAtfu2zQsP71+W3x4L9+wxdcjWeebhGlZV7dtSuswYe56bNMmbH9MG//MgCzrPuWuVwiuS9tTHqfd5Iurnt3dC8ll2BXfpFz3/Jtw97zrxbq0YjHC3d5W9fnb+utRz9ueUfijPT8B7ocgub39083/DgAA//9HdjH+mjQAAA==" -> "H4sIAAAAAAAA/9S6aZOcSJYu/D3N+j8w6jKb97WazGSJIBXq1tgEAcSWuCeLO8vcMRlbBjjOIiAW6K7/fs2JlCZTUqmm770fZmSGVeHL8XOe85zFM1jVVZ9W/a0zNOkHrjzSPm/Ctr8v80ua/IWL6mOVhO3w8Z2xNTQFIqAuLf/dDXu7xWnb5XX1gRPu+D/d/Onm9vb1oj/dfJGt5l1Td3k/rQ37PoyzMq36v3DPOU2rsEw/vsurvL+Lnw/v/nOX04ZV95y2t1oV10leHT5wD1Hev1owqdynl/4+pvUxuY3r6jk//OnGyMv0O+X+/HrNzc2xS9vuww3H3XJMgw9cGou3bPCG4ziu67JP4bHP6jYf0+RTkQ7TWvbvlnvXddlt24XccrlcKhIYw5UwxKLGXtWluVSWy+Vqaa4u5Fnfbun6eVUt8phuhtJtNaV1kEgf5b6w146QNg/J6mk8C8SX3Soz6ZNnNOlTm4ML8Oj6fezCxb2lN0rCjwv9DIZfi+dDtng+DsCfLba/GqEMBwcrh3kGav3ybHnreb7p43vbpFWk6fm+sYsZzZt6Zga90peH5edDYS9ldcyGQyQf58Yivzjby8xVyNE2+LVnjoA06fOQu8dfu631ayai1iz2S+V43Ppm1BL6q57hMnw8tafBgeKxg/2p8hWSRU/nAT6I7hMJm31yv8ic8POTJpz1QUa6WHnx7Olw5g+5GcldHunO+ACc9OJKc3Px/nNjQtfw93FzCFpqh5vNPrCNrB/hg5EELXzUkVfbwjJdDrND1seghYpDo7l9enqQxpH/rFi6GK/gDPLnZn4+f37KTmex6iOpcR6f+iTtd7/iOW8+VU3lDbZdBY046uc4FYXIu8gPVbagVfbYBgeSPsS1WT0t9ct9TCVZs3fDIT8+xcr510J47x+pb3joc6j0xXn3WFhEbYjjienc2AlyrT50u008u3fnxfD8eEqMDmfJZ2HlbdYYw2asDxG/mGM/5y1Pb6rAuhdSfFjdW7+6eOj9Z/893z5jGCfLWlwHz9VuPvoW8na7hREUYXW5SNoDgnmh7cCiQ0Tk+VFeDQO/fd5+dqKdoMyfH54TKYyt9nGmxj5K9O29oAzAlXWBPMRBvlzD3R5Eo6fzjtQ/v7/wqWB+/MiVIanbf2vTJAv7u7gu373le5qI87mwmDi/unKeBupWAI42Z2PbJ0UgOp01su4o+WXjyGdYyN77itwHD2n9BEzt3uDP+9n7+Z6ro2MS5m8Ouzm3eZ9+YhnhJSybsM8+cPd92VzD+xPLEZ9OYdtNmsXXLPCB+/uLotBW0PZR/bSChrF1Pr6X4vD5Pc+nc3EuzqKZMHt+eJ5Hz/Mw5RMpXghi/H4hLMSX3StoPEFbs75sX0RiMpfn89n8YS5K0vuHmRBJqRim4fP7B0l+SEUpfC8ms28PX35aaZbz8dHm+0dbWFko2Tm5olp4h2wU7ExeR9Y0x/erQtjZyNKwBlTTDbyA1yUb7ZSApxipwDREfwRYWaNiLkRiwKelMXfUQrTWGYpES0l4y3JR8xgJzS7cBMQpdMtC571JdSXhg88WxsAs6MZ0dGwhXUr4S27w8ybQky4WGhV4AYlcINnrjDiF8Nn0kiesYdnBVpAiQcMO8MI1gI7XKMm5YXOzN3OF7jl4ZyU8rlxkuQjrmqXpfFIag030DEtZ66z5eYob2eSBgngqWboe2EV/cgtaJyWAq0nn3QohXQvEREeark1r3YXK3s1CB2altC7WfRsDwx+zR9dtAMK0SivFgggohrB7NMpka6nKxff0MSGHvY93BBeGCKgxD4rsYiF0CdEFu9p7yVB3VkrwGIpNbUjNxdnQDSKZhKh/ehTBznC3l5goOMWN4/OX0BBiCeNmMM81D1Sr9KV6dDw6i3QgYwEHSFAqs6CP4TpR4EbvY9rYhrsofdca0g22nVU/RkWg2W4/M6S49Ud9H2B8NErQGXrSrCjmXXW3sYRAtWgCHFE/BYXVujpWrQo/2ptkj9xk7Wys0dZA6LqgTGji2noTgmI2S/jkbFA9dJ3t3B8zIfKUzwZe7pEWdK5mzIK1HjqakLk6zS1HAbZnuYYGtnalSBZPz35FjxGmKFr1o1VhMVKtE14LQ7qpT6mXybFmibgQnuJC30VmM4vEToop7vEGF9Ya60jYrRwxUQzUCz4SbLzBme0pVjTuikgKLvtxebFKfzTRbMAIKAmPFdPVIdaEteUlW4SptqKBbWiLlUmpbhW1FDiBb0jFOVgvuthe7H0aNH5Bm0S0jkhYtqAQVlBLFAPjwvYSy0XCykf62iYJBfQwpo5SROJ5/zt7lS97LS/RzXwhIRQAEwkr0/VnP46ry1eOmodGsapGBCKlNh/PI715jIvt4LhCGGr6xdaokbqXzJGoGzuxZI105eAdsipwdivEG5utZAmW5PNWnZQHwULgZOt6viovbeIoPkALP+At0d2AVbxerO3NTjS0/sl2Lw4Q8N7w/DNYdyeb0srdxG20bhDeGCfoNeeIZDYuL328QSeLF54cB+2Ru9ugVQ9DgsN4xKXFB16ozSTH2QrI7TFUd/tok1G70DvkZVtTvKhojWeoAMB39DnwlhJezyuoKo82TfgUKyY0Gx6JCTCrpQQwtgP3PQ8QmiGtGexqOYYbegL6bgbxzrLEfkhdYNteUppFJoZSBuwyOMaiIbn2QgQuFSyS9akmyCsCeL+o53u+mVtIF+xNffGLRIgR8PeSvkfYQslqYUWjPyRF4vmomCMhePSpMfNxZpjjDoJKJ6G7u8QEzQJiaXZh7u0KdI79Xoo3YB4T/QQ8i/eL3RHQQjA9Y7HKrznZQnNtqwEdUWtnFVQ1saVfczm//65SsERvinhI1rQMXZAlaySv8uVhu1I037MyeKgP29Xy+ugBjSvQROJM3qrGYa8qMyMv9l/nV4oTeLvGd88Hp8K9X+Lhzf7rIxpqPYNOPfPH+myMDQVOU4KxKcBY81BtCn+sL8ZYC4Faj75Tn31Sz8H03hSB02SBU18AqS/QaXLwRj/QBOI8SzZ4CGxFidbJKS4pH655ebsBte9sBUCTJllnNuJ1PSrBkHoKH7qL49Xm62N7YExcPMBcUR0inGJxJ4TupXgsF0NwfoNHFq1pEXrW/PX+6dHmp2SlrAI3OMUlkrdak0X58mKwR60H4NQDXC0HQ91etloC8PJbnBQYSebBdAM+8LYHmCt7350dDGfJHtkgSDbI4WCQ5WjYysbB5hs/JO7uc+ACHuYKjVy9iTS9CDY7GkvGIpJAnri0C9Z4iHllCFyr9j3z6IuL/rUdSMJ5WGKSrBQzcXdd6BoHW8TzrUaPQfle/s5mXRH88tL4g/IYeMXBdC9VJO0Y3j3MlSEWfx/zV7rbiNcOaIPzaE3JI+pp6tSHvbo9A/Vw8EvK783vODU9jrsoEvcixGO9/9H8y3M21KYEpCkCtSHMF9BpMuCwwljPoVoLBql5QGp2iaDQaYhBauaz0SA/k6tQQJjcej75l9R8oDZl4NSS4dSjP9aiT5ocOPXIOB84TH4t+E5DAuen+s4Dptckp8l9px78sZZYrBikFtl+Q60vTO8XWSy2zpPeP5c7BGotgrGWDLUhTG7AMBibnI0BtSl9hguzgzSloda8T2rRcGrh53KV0ncmfcRAneKUYTFAdgapR6ZfMOHD9GtypqfvTHHOB+pP9WWyeMNpSmNkxbUpDdIUTE82BtR68AnLDSxH1HPfaSjzM8snf+C3zB+ZjHqEDtO5Kf1xyk0iUCd8qU/qmTFOdki+c/VpQCacf6YvP+WnkfGpocZYXwLmnyvnzkzvgNQCvOI6GM6UE4TAqc/g5/yVGDf9cbLrDFUmuyl9MvHs8iJjbjjMt03GeMN4FjA+/1SuQg21Fl9iYRaoTQbUhoKxngVXbOYBYfxrqD9OskSD8Zkwu36OwzWHN5TpzXBk/g6u8cX0m4GXPA/UWgCknjEbAJnw/5nciTPGhEV9YXgEpMmM6ZzJhzyz3WecYeNsrVOfWSz9gdwJL4YnVBk/J/sk4xqDZ+YfqNYzxmVjmpv4MAK1yfyf+40PHBaj9WAQFgsTN2ZQZe/TWRPWkPGa+ZThwuKO1Jc/8FsJJ56y3NXk/sh4X48sBzEeT7ybuHGN8SlmGN9YXPw8jnNwjfth0kW9+g+Q+mw4TWZMua0pWCz6ZKrZZxYfhvpH+WE5QnXKkTMWBz7LV+q1B4Aq8+PE4/PEN6cW4LX+sxyVBT+N4yXLfzk4/7g2WF52jsQ5jSpT3qq+ABxD2q4O51TVzoa6vLypKfpBMFQqGoNC041Fo6nnmY/f9zKKD5zlPCHGwSz1kdVHU1wcY8kafJcek40hb9dgCD2r8UW9+516p5pOszbRxbG+q2v/Kf9VLZ5qq+0yvawmKCmNSX34seylCNRGsaZ83Kwtp9Esp1kZTqMxzllqo7O6wcZNp1nBa21aMf4AppNTixZpdIs0iuE0qvUz+z3Mh+sFs3W+1Xqa2souWOPjta9kvdTyx75b9zR1aQEJ1WFh6bBAc0gSDRb+AAvzAgtLgWQrwEJfTWMEryBBIiRbERbGDJJsBclSgsSXIDFnsAjWsNgpv4O1Fno76LsChfni573dqycW8RC6egcJWEMSj7BgZyVrSBIdEmsNiSZAoo2QBDostAssgtW0blprDrAINFigGSRMXzRe15jn1U/wnPosHY++m1CYK2TqY12QRd/1iS/8XtMq9KwsWilO6CZH37OEuETdiy9Y39XE64zGpcBi4DtfuCo6Q88ftxqeJWt8DNa4eNmLY1GvAuf3OKYgRzcOWMT5Vgc0rgIa54qSeFYduHP+eqegp+gntr7ithJtLBqXc7ZHDGzlxVe/wx3NgmhsSCQK50gCNM7nb/05nA+WNndgBXiG42MJTpGnnJg/H8vF6Fe4idbmMZJ21eNK0RxqyL6XjD9b93I3eo3xt33uGK61ATiBF3pWjShQLHdO4oqev8dByeAUa/XcYHchMtUxMvU21x6O1QhWBy9f+kiWd1m/wOr01Pc4U0/5Bh9fNGS43soB0WQwLmUgIjlwlnLganJQIhmst7LhFLJBCjlQNdl3kByovuyXmmyoBzlYIxk65tv+fo0pJAfG3wGWuwyWAYFEKSE5zCFZsrgsICnO1zW4hOWugMSfwRJnsEQDJGx9/M19UGE1aM5qx3TXY/0hq1vMJpX1SlMvM9Vv1ieCa+8wD1i9UOshYP0omfqbN/ZD15ADYsrAMWR/NGXfOUxYGKUvBy6SjZHZiWRfRDJk744mQxXJhhrL/hhPYwFZvrVfXfKQZAUsDR6WeglLk4dEE2FpziDZjpAoBSwRD0v/Asl2BkksQnIYIdF4SHxx2kfMyzc1ZM56z0Cd7r2sfxin+68zvbO+k9V0Aqaa3WTX+l2L7G7sk/ocsLvG2OTwm37GcJAMiC9Dx5ABw2GykdnF/G7KYNzKvshs3srAiWWgMq4cZN/xZX/Cjdnvf+N/ncBSzyHx51MOI8Uckl0JS3SGpXaGxOch2TJbR0gOAiy1ARJ0gcQqIVnOpvlSE771P1Cb3Lj2qZepV2bvhNX+CQfJuP4tgDdeYoD1eAyviRfq1FeyvuYt/51YNsalbDD7RCQbrikbjNtrdmeOZZ/4clBqEw4GixXVnPgORsabQgYl48j2G/8fREgSAomew9KikMQ8JDqFpTFCYpwhATksffFaB+IBku0ACePMVoBEIZBQOu196392j2FxTIxx6oeEiQ/OFPMzMDbFy31UmO6nLAaY3WOTT/39NMZ69rf2sxgPSl8Ga1MOVFMGqjHZZrA4KJHsk61slGxcm3zP8kWgLid+AGcrB86P4h9kkMTzK6eX5y9/bDILvLHR7GDy2MYaXdsIKFhD09yj2QAbUS11G9Xk9cEWEyXh6cp0kx3GdBchQdkLh9FwlM8+jy6GGqjAtQpD0njMJ7nrJRrCdG+Li9B2M9Hn5wpC2FgVO8v0knVYYOyg3c7itQtGWEmkxPAJgKFredEGhOaIRV8USMJntc/PQVhgycGWniIBmR6FWCt4LE4/HMiWF+/ZXMK/nmuUCAkO8pJdIHyjh9uvrDJzX/9Q4NJsn1J9a5eX0BKzOtAMITwwPitSICZ6iATF0BIVSfoG8TQ3eMuy0E5BGCumY+3MwpJML6kCHj+a7mJnFrplqdvR5/VzrGPHxbh1na3o89RaFYLgk11rCg18FOc6XGsS9moppE2WVsvBLUEeSaAwtOaS8Lva95pTyDcSGvWjzwunBG+lQF22MW5MqGE+1HEZCcXep7sgQj2Ih/4zEnerxAUnQC3bLbYzY0zmBla2htaJQMR9gkze2Ohyqi08Y8w+W8LuAogFIheLwF402OVH7GEQmI3s87r+OOq1o1EHl3hlCMXMWCefw7wbLRz4sRYcY5yFQTFrzUo5u86uBY7JA3cmxRWARtEN9ro/OSr+7Hi6mZb6eVVmWsRjNxICzy2ssykoq7QMTom7nSEh401xgS0072y9yQN0aQMX7EN+odoemNkbnzc2Ox24+i6W0BgisAcq4qMq3gOd5inyT+FG751NUzkIzC3tMNpav0t0WhnrXZ7wNMBrAQZ8Uj1KFgQjUNwqwXhNrYDXL7aDy0AEBLkCxYLOJ+dmMDxtNN0EmIWuWGJTBSSTAjGQEt5Sph+fiIJMrG8f+Z1ie4liaXphlgnERWYBDa8DQcdu0fGuveBBdThHBJxWNONjBwPAa5e9yJ+SckHgJsEIUw3T7TksdnokJY6NdBxVphSvg9LRt0OIkwGuLzzmmzFEl5VRWrvHMbmEWnJBuNg7aBekWqCZGKwCfu6ahQ4cZAzQa4KIBme/SKzE3Y52Oa9CXTv5w6J4FIMW6oFukKDejwCmRBENcfFkFYva0CzFOTeTLFvXZmahl1DDKxMJqlnqSsJj6QWDzix0KeFB5SL6mAh0ZVId25ouWV7ifrELFTsdbBJkI4pXtBigZxFrpLJLsx3TyylpgcXL6BaGkJSgDxDYRMXs7OKkiLRL71RB7mo70R93boou/fd2zfaBmNXh2hwdDwcGobzPx/OUNr7t4R/+CPntD4Mm1nVH21kmslhMr0zUV4bZtAlPSVoFul2ZA3IxwZop2aK+NTyLpOg8c7VtC7TFsBfALJSWZx9nXuImnwP38gQKiuNqO7NUqzWFLDR56oNRP61IINgVIImWEEu3Roj6AWtzP+T7c7qhl0DFKnRpEW/qM3YyJxoz51HCAOHsKSqzjVVsZ4GLZiYGMNW6E0YBH4j13lpjlGr91kfW2hJ3OsKNDDF4TEZzCMVmiJCQY0lv7LLxkqFHCdq5kdsNqMRr4AHsS+BiCv7ZUa1zTHcu9PR5fGgyXCxCZ9WrgdCoqGxqHzU23iR1KCkFkpoLKi0rlpaS74KZU+jbKO95vO4VZ0MvvpQoEbEKW4z5qLLEeENNGwO8Ko1TtMEgEuqZNRaCoWWj4yVPjwJFvkh3Fmqs1MUbYwzqZLRW/rDoEX8YrKJxUQlcawM8XARZQOITXlu2tQazMO/2sVhcTKqPKdV7A126SBPOwE0k0+H3Lz+S605h/k4NrD9++6OLbT9+2mu+/WlpgY9hW30Iz92HLo3btO/KsAoPafvh2N2mYdffCh8WkvQwF4XFw2KxeFn1Ia/6tK1C+imuy6bu0nb6vOe2q0/trHg5zkaKvbK2T84Wgk/GEizXL18GLIH6f35yd4y6uM2bPq+r25ctt3FdlmGV3BamT+vFl/N929GMTxtoO2BpaB+7Pjzk1eH2i+63X3S/C8/d3deXuouOOU3u6vbwLW7q1vp4n/bx/cuarxK+nKitLM2xvxqrAfUJboHzCVmPH7O+b7oP9/enJk5v+USQhPlM4uX5bBEJcXK7GC/twzg/3b1F4+4rGnds411YhmNdvSh8//objx/p9d3AXV+X9Meffvx7UZP8P15eQkrrc5p8SuoyzKuO+8j9O/euT8PyNTzv/oV7lx2ju6hNz9+On+u2SNvvp7gvJ8Qh95F792Ot4/A2bvu7Ji3f3XzR7irwH9bv/5kev/9l3j/yjd3ltstSSq8M/r2P7P7pPsqr+yjsspsu7bnb9FhzTd6kz2FOb7r62Mbpjz/pufkzZ6c912cp1w1dn5ZcVnd9FZbp3c2X/4t7ynVpf/vlnfvlmzj5n2KplR7yrk/bydy86vqwilPunPcZZ23A3c39sWvvaR2HdDokPHfc29DiDml/ex26PYX0mHL/i8XTl6E84X752x/lsN+4v3PkM3fbcu/u7Gmf3bd5dXjH/etV8dfp6tPLwZ9e0tUd6erq5sv2n618918Uxv2dm8BsS+72+b+qwP8Qf6tpQ+th8vZLoHKrJRenbZ8/53HYp3c3Udil8oy7Tbhb7q9//Sv3y9+++aTsN+5fuV/+9jqf//YqyL855Usa+KMz3nzL8MMTXgT90TlFOvxf0DatkqbOq/722FLG3J/Uot9+wPQfNgd/SO835f8tn19Pvfu91VfCfgX0J9gxcBh2r6j9g8P/u3D5RlPsT7YDreVa+3ifpKf76lSmQiXc2M7S0a6dxCls72kefd9NvOTxY8N1fd2Gh5Srq680ubvJn7l/4g5t2jA3fxH3G3fftHV8X9bHqu/+wphV3XDcnzmt6o5tymmKzeUd93ykdGDFv0rjPk2457zt+rsbjnuuW87ZGprF5RX3N/7uTuL53/7CJfVUJ/NnruvDnvvllV1fz2D/ojYNr43fc379+pumacMJNxyX1FV6M6myytK4YLI83Z6+W3+pUnnHhbRNw2TgyjBJmTqTjZfn7lNePde/d2xZPHd3l+fuzfzNpMJ0nhEWX5PFV3QnQ1Iuyds07ut2YEeVedfl1YEdXBZJ3nK3b7G9ilsmCdfX107ruevDiAurhJsAZzvTOKu5d7/87ZUuv731EFM1SZ/DI+07juf4d9zfuT5NudvwlVCmAxP51qhJAStlTLO1x7w6Xq4d3KXv2NltypiSxnXF3Von7gu1rtsYl16h3aTtZG9dTVvjrD6zXdynb5H68N3ID0DBaZs/s0QWvjQeL4zNO+7c5n0Y0fSG4/r6GGdvdt/fNW19ypkaeXX4FDNqMEOm8P7Dhc/5f5tQ/4OytUzIsev/M8n3NUdZ31KxmA65qq5uWeuShG3CNXXbX5HMO46mXcfRvEjpwDZF6c2fuS4OqypNJt41bR2lyd3NnzkHqvD/K7NwSNLq///AuSlXpWxRHDMRjBptHrP637EzmZOqtGeNMUfTU0q5sOe6umTypwLyL1x07LlzygL3n3suC08pl/dcmx+ynqvq893N1xiZWHulVfLy3++y2W3Y5HddHRdpf5fc3zC+/+Pb6lPatnmS3sV19cyKz5RSj5Ryf/0rp0H95t/tael/3DxO4Np9m4blx7dvi/cP8g1bfD2SdcJJmJZ1ddumtA4T5q6nNm3C9vus8c8MyLLuU+56o+C6tD3lcdpNvrjq2d29klyGXfFVynXPvwl3L7terUsrFiLc7W1Vn7+uvx71su0FhT/a8wPgvouR29s/3fzvAAAA//8GwsrorTQAAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-06b4645a96b301861" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 7 -> (known after apply)
        id                      = "lt-04e6df10bd74694e7"
      ~ latest_version          = 7 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTcyLjMxLjY0LjExCk9TQlVJTERfQ0FfQ0VSVD1MUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VSRVZFTkRRV1pYWjBGM1NVSkJaMGxWVUROUU0yWXpOVkJHVWs1MWIyWjBlbU01VERrMlJHaFViMlJCZDBSUldVcExiMXBKYUhaalRrRlJSVXdLUWxGQmQwWnFSVlZOUWtsSFFURlZSVUYzZDB4aU0wNXBaRmRzYzFwRE5YWmpiV04zU0doalRrMXFRWGRQVkVWNlRWUlplVTFFVlROWGFHTk9UWHBCZHdwUFZFVjRUVlJaZVUxRVZUTlhha0ZYVFZKUmQwVm5XVVJXVVZGRVJFRjBkbU15U2pGaFYzaHJURzA1ZVZwNlEwTkJVMGwzUkZGWlNrdHZXa2xvZG1OT0NrRlJSVUpDVVVGRVoyZEZVRUZFUTBOQlVXOURaMmRGUWtGTlFuQnJXVkZZU1ZOTVl6aExXV3BOVVZsbmVuQlJPVU5CTTFKTE1tZElSREJ4WVhGemRqZ0tZVkpqVmtNMk5sTTVaa2h4UlVVeGFVeFZXRTgzTURKUmVqVnphMnBvTTNweFRIbEhVamgzVWxZdkwyTkpNV0l4Y2pCVmVWcFRZMHhhTTFjM1ZWcHlRd28wTkRSbVkzb3pUWGw0YkZONlYxVlpVMUJuUWtsTGFHZEJPSEZ0Y2xwU01XOW1ZV1J5ZUhWU1RDdHpia1pFU1d0NE0zY3JZekZLWlZWdU1tTnNNRmRwQ2xWMFdESkhSMVpEUmxkTlQyRnZaa1JyV0ZWRFJuVkxTSGRLVVdkR1RIUnpTRU5hV1dObWRsZFdTRnBhTms0NGQwZHdNbEZhV1RJNVl6aDFiWEJxTVZBS1VFWnNXRU00WkdGYVRFMWhXRmxpUlRCTlNYUldNRU5JU25CM1IwbHdZbmx1YlZsVWJDdHpSblYyYkRSdlZHMXllSG92ZVhoNmNFUjJWazFQY2tGSmJRcDRiMnMzY2xWdFZIVmtSR1ZGVTFKQ1QyZEJNVXQxWVUxU1ZIVmhTWEJSYnpKa2IzWnhLekF4Um1ZelFVNHlWVU5CZDBWQlFXRk9WRTFHUlhkSVVWbEVDbFpTTUU5Q1FsbEZSa28zWlRaWU0za3daRzlzY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFDT0VkQk1WVmtTWGRSV1UxQ1lVRkdTamRsTmxnemVUQmtiMndLY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFCT0VkQk1WVmtSWGRGUWk5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWdwQlJucDJOMmxsUzBjNWJGcExja0l5VFcxYWFFRnhTRWxNZVd4aFQzbFdjVGMzUnpsQ1RWSlVSbk53V25VME1ISTNSMVIzWTBSb2RtZzFSVU52U0ZGaUNteHJkVEJZTlU5WVowUjJXSE5DY0c5R1NISjJNRXRQU1d4VE4xVktNWFl3TkdzdlNsbG5XSGNyYkdwVVZITXZPWHB3YmpoU1ZteHRjSFV2UjAxUFRUVUtVV0pIVUN0T2FqVmFjelZtUjBaWGFFNDNUVEkxVVd0Vk9ESktiSGhsU2tGc1VYaElRMnhEVUdWNFVrTk5ZVEY1TlhBM1ZHNW5PREJMU2xkMGVWQlFPUXAwVTJkTlFuQTNOVlZTWlc4ME5VVTRVRXB5U25BemFIbHZORko0T1ZKUlIydHllV05TU1hkbVFraDJhM2hOU21adWMyTTNXUzkyTldsMVJqaHRlRTE2Q2pOMFlrbzVLMHA1UlVGMVNIb3hZa2QxY1VOWUszRktVVlJVZEM5UmJ6WXlka2RYWVVrNVUxWkxZbE00WVZoTVF6Sk9ObkZqYVdKeGNqVTRaalJFU2tRS1NuTnNUUzgzY0hONWNqRnZOWFIwWWtKdU5sazFRWE05Q2kwdExTMHRSVTVFSUVORlVsUkpSa2xEUVZSRkxTMHRMUzBLCldPUktFUl9TU0xfS0VZU19BUk49YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy1lYXN0LTE6OTMzNzUyMTk3OTk5OnNlY3JldDpicmV3X2tleXMtN0ZVZWVsCgojIFZhcmlhYmxlcyBmb3IgdGhlIHNjcmlwdC4KQ09NUE9TRVJfRElSPS9ldGMvb3NidWlsZC1jb21wb3NlcgoKIyBBZGQgbWhheWRlbidzIFNTSCBrZXkgdGVtcG9yYXJpbHkuCmN1cmwgaHR0cHM6Ly9naXRodWIuY29tL21ham9yLmtleXMgPj4gL2hvbWUvZWMyLXVzZXIvLnNzaC9hdXRob3JpemVkX2tleXMKCiMgU2V0IHVwIC9ldGMvaG9zdHMKIyBUT0RPKG1oYXlkZW4pOiBXZSBuZWVkIHRvIGNvbnZlcnQgdGhpcyB0byBETlMgbGF0ZXIgd2hlbiB3ZSBsYXVuY2guCmNhdCA8PDwgIiR7Q09NUE9TRVJfQUREUkVTU30gJHtDT01QT1NFUl9IT1NUfSIgPj4gL2V0Yy9ob3N0cwoKIyBEZXBsb3kgdGhlIGNvbXBvc2VyIENBIGNlcnRpZmljYXRlLgpta2RpciAke0NPTVBPU0VSX0RJUn0KYmFzZTY0IC1kIC0gPDw8ICR7T1NCVUlMRF9DQV9DRVJUfSA+ICR7Q09NUE9TRVJfRElSfS9jYS1jcnQucGVtCgojIERlcGxveSB0aGUgY29tcG9zZXIga2V5IGFuZCBjZXJ0aWZpY2F0ZS4KL3Vzci9sb2NhbC9iaW4vYXdzIHNlY3JldHNtYW5hZ2VyIGdldC1zZWNyZXQtdmFsdWUgXAogIC0tc2VjcmV0LWlkICR7V09SS0VSX1NTTF9LRVlTX0FSTn0gfCBqcSAtciAiLlNlY3JldFN0cmluZyIgPiAvdG1wL3dvcmtlcl9rZXlzLmpzb24KanEgLXIgIi53b3JrZXJfa2V5IiAvdG1wL3dvcmtlcl9rZXlzLmpzb24gfCBiYXNlNjQgLWQgLSA+ICR7Q09NUE9TRVJfRElSfS93b3JrZXIta2V5LnBlbQpqcSAtciAiLndvcmtlcl9jcnQiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1jcnQucGVtCnJtIC1mIC90bXAvd29ya2VyX2tleXMuanNvbgoKIyBQcmVwYXJlIG9zYnVpbGQtY29tcG9zZXIncyByZW1vdGUgd29ya2VyIHNlcnZpY2VzIGFuZCBzb2NrZXRzLgpzeXN0ZW1jdGwgZW5hYmxlIC0tbm93IG9zYnVpbGQtcmVtb3RlLXdvcmtlckAke0NPTVBPU0VSX0hPU1R9Ojg3MDAKCg==" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 8 -> (known after apply)
        id                      = "lt-0aae9d85fdd3f7067"
      ~ latest_version          = 8 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTAuMzAuMTguMTEKT1NCVUlMRF9DQV9DRVJUPUxTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVVJFVkVORFFXWlhaMEYzU1VKQlowbFZVRE5RTTJZek5WQkdVazUxYjJaMGVtTTVURGsyUkdoVWIyUkJkMFJSV1VwTGIxcEphSFpqVGtGUlJVd0tRbEZCZDBacVJWVk5Ra2xIUVRGVlJVRjNkMHhpTTA1cFpGZHNjMXBETlhaamJXTjNTR2hqVGsxcVFYZFBWRVY2VFZSWmVVMUVWVE5YYUdOT1RYcEJkd3BQVkVWNFRWUlplVTFFVlROWGFrRlhUVkpSZDBWbldVUldVVkZFUkVGMGRtTXlTakZoVjNoclRHMDVlVnA2UTBOQlUwbDNSRkZaU2t0dldrbG9kbU5PQ2tGUlJVSkNVVUZFWjJkRlVFRkVRME5CVVc5RFoyZEZRa0ZOUW5CcldWRllTVk5NWXpoTFdXcE5VVmxuZW5CUk9VTkJNMUpMTW1kSVJEQnhZWEZ6ZGpnS1lWSmpWa00yTmxNNVpraHhSVVV4YVV4VldFODNNREpSZWpWemEycG9NM3B4VEhsSFVqaDNVbFl2TDJOSk1XSXhjakJWZVZwVFkweGFNMWMzVlZweVF3bzBORFJtWTNvelRYbDRiRk42VjFWWlUxQm5Ra2xMYUdkQk9IRnRjbHBTTVc5bVlXUnllSFZTVEN0emJrWkVTV3Q0TTNjcll6RktaVlZ1TW1Oc01GZHBDbFYwV0RKSFIxWkRSbGROVDJGdlprUnJXRlZEUm5WTFNIZEtVV2RHVEhSelNFTmFXV05tZGxkV1NGcGFOazQ0ZDBkd01sRmFXVEk1WXpoMWJYQnFNVkFLVUVac1dFTTRaR0ZhVEUxaFdGbGlSVEJOU1hSV01FTklTbkIzUjBsd1lubHViVmxVYkN0elJuVjJiRFJ2VkcxeWVIb3ZlWGg2Y0VSMlZrMVBja0ZKYlFwNGIyczNjbFZ0VkhWa1JHVkZVMUpDVDJkQk1VdDFZVTFTVkhWaFNYQlJiekprYjNaeEt6QXhSbVl6UVU0eVZVTkJkMFZCUVdGT1ZFMUdSWGRJVVZsRUNsWlNNRTlDUWxsRlJrbzNaVFpZTTNrd1pHOXNjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUNPRWRCTVZWa1NYZFJXVTFDWVVGR1NqZGxObGd6ZVRCa2Iyd0tjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUJPRWRCTVZWa1JYZEZRaTkzVVVaTlFVMUNRV1k0ZDBSUldVcExiMXBKYUhaalRrRlJSVXhDVVVGRVoyZEZRZ3BCUm5wMk4ybGxTMGM1YkZwTGNrSXlUVzFhYUVGeFNFbE1lV3hoVDNsV2NUYzNSemxDVFZKVVJuTndXblUwTUhJM1IxUjNZMFJvZG1nMVJVTnZTRkZpQ214cmRUQllOVTlZWjBSMldITkNjRzlHU0hKMk1FdFBTV3hUTjFWS01YWXdOR3N2U2xsbldIY3JiR3BVVkhNdk9YcHdiamhTVm14dGNIVXZSMDFQVFRVS1VXSkhVQ3RPYWpWYWN6Vm1SMFpYYUU0M1RUSTFVV3RWT0RKS2JIaGxTa0ZzVVhoSVEyeERVR1Y0VWtOTllURjVOWEEzVkc1bk9EQkxTbGQwZVZCUU9RcDBVMmROUW5BM05WVlNaVzgwTlVVNFVFcHlTbkF6YUhsdk5GSjRPVkpSUjJ0eWVXTlNTWGRtUWtoMmEzaE5TbVp1YzJNM1dTOTJOV2wxUmpodGVFMTZDak4wWWtvNUswcDVSVUYxU0hveFlrZDFjVU5ZSzNGS1VWUlVkQzlSYnpZeWRrZFhZVWs1VTFaTFlsTTRZVmhNUXpKT05uRmphV0p4Y2pVNFpqUkVTa1FLU25Oc1RTODNjSE41Y2pGdk5YUjBZa0p1TmxrMVFYTTlDaTB0TFMwdFJVNUVJRU5GVWxSSlJrbERRVlJGTFMwdExTMEsKV09SS0VSX1NTTF9LRVlTX0FSTj1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLWVhc3QtMTo5MzM3NTIxOTc5OTk6c2VjcmV0OmJyZXdfa2V5cy03RlVlZWwKCiMgVmFyaWFibGVzIGZvciB0aGUgc2NyaXB0LgpDT01QT1NFUl9ESVI9L2V0Yy9vc2J1aWxkLWNvbXBvc2VyCgojIEFkZCBtaGF5ZGVuJ3MgU1NIIGtleSB0ZW1wb3JhcmlseS4KY3VybCBodHRwczovL2dpdGh1Yi5jb20vbWFqb3Iua2V5cyA+PiAvaG9tZS9lYzItdXNlci8uc3NoL2F1dGhvcml6ZWRfa2V5cwoKIyBTZXQgdXAgL2V0Yy9ob3N0cwojIFRPRE8obWhheWRlbik6IFdlIG5lZWQgdG8gY29udmVydCB0aGlzIHRvIEROUyBsYXRlciB3aGVuIHdlIGxhdW5jaC4KY2F0IDw8PCAiJHtDT01QT1NFUl9BRERSRVNTfSAke0NPTVBPU0VSX0hPU1R9IiA+PiAvZXRjL2hvc3RzCgojIERlcGxveSB0aGUgY29tcG9zZXIgQ0EgY2VydGlmaWNhdGUuCm1rZGlyICR7Q09NUE9TRVJfRElSfQpiYXNlNjQgLWQgLSA8PDwgJHtPU0JVSUxEX0NBX0NFUlR9ID4gJHtDT01QT1NFUl9ESVJ9L2NhLWNydC5wZW0KCiMgRGVwbG95IHRoZSBjb21wb3NlciBrZXkgYW5kIGNlcnRpZmljYXRlLgovdXNyL2xvY2FsL2Jpbi9hd3Mgc2VjcmV0c21hbmFnZXIgZ2V0LXNlY3JldC12YWx1ZSBcCiAgLS1zZWNyZXQtaWQgJHtXT1JLRVJfU1NMX0tFWVNfQVJOfSB8IGpxIC1yICIuU2VjcmV0U3RyaW5nIiA+IC90bXAvd29ya2VyX2tleXMuanNvbgpqcSAtciAiLndvcmtlcl9rZXkiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1rZXkucGVtCmpxIC1yICIud29ya2VyX2NydCIgL3RtcC93b3JrZXJfa2V5cy5qc29uIHwgYmFzZTY0IC1kIC0gPiAke0NPTVBPU0VSX0RJUn0vd29ya2VyLWNydC5wZW0Kcm0gLWYgL3RtcC93b3JrZXJfa2V5cy5qc29uCgojIFByZXBhcmUgb3NidWlsZC1jb21wb3NlcidzIHJlbW90ZSB3b3JrZXIgc2VydmljZXMgYW5kIHNvY2tldHMuCnN5c3RlbWN0bCBlbmFibGUgLS1ub3cgb3NidWlsZC1yZW1vdGUtd29ya2VyQCR7Q09NUE9TRVJfSE9TVH06ODcwMAoK" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210118191027393500000001" -> (known after apply)
      ~ id                                  = "sfr-8d6ce64a-1d32-4e0b-8500-441a36580d47" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-04e6df10bd74694e7" -> null
              - version = "7" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-04e6df10bd74694e7"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210118191046799700000002" -> (known after apply)
      ~ id                                  = "sfr-6b93629a-abab-4866-9715-12e8decf1e81" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0aae9d85fdd3f7067" -> null
              - version = "8" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0aae9d85fdd3f7067"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-4091634052" -> (known after apply)
      ~ instance_id = "i-0d6ed139b1e6125d6" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-1524497874" -> (known after apply)
      ~ instance_id = "i-0f3d9c62e8a3c38d9" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*